###################################################################

# Created by write_sdc on Mon Aug  1 17:17:44 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
clk]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_config_enable]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_enable]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
reset]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[1]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[0]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[2]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[1]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[0]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[6]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[5]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[4]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[3]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[2]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[3]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[2]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[1]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[0]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[6]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[5]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[4]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[3]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[4]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[3]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[2]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[1]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[0]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[6]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[5]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[4]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[5]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[4]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[3]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[2]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[1]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[0]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[6]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[5]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[6]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[5]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[4]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[3]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[2]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[1]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[0]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[6]}]
set_load -pin_load 0.19856 [get_ports {io_result[6]}]
set_load -pin_load 0.19856 [get_ports {io_result[5]}]
set_load -pin_load 0.19856 [get_ports {io_result[4]}]
set_load -pin_load 0.19856 [get_ports {io_result[3]}]
set_load -pin_load 0.19856 [get_ports {io_result[2]}]
set_load -pin_load 0.19856 [get_ports {io_result[1]}]
set_load -pin_load 0.19856 [get_ports {io_result[0]}]
set_load -pin_load 0.19856 [get_ports io_opB_isLocal]
set_load -pin_load 0.19856 [get_ports io_opA_isLocal]
set_load -pin_load 0.19856 [get_ports io_rmux1]
set_load -pin_load 0.19856 [get_ports io_rmux0]
set_load -pin_load 0.19856 [get_ports io_done]
set_max_transition 0.1 [get_ports {io_scalarOut[1]}]
set_max_transition 0.1 [get_ports {io_scalarOut[0]}]
set_max_transition 0.1 [get_ports {io_opcode[2]}]
set_max_transition 0.1 [get_ports {io_opcode[1]}]
set_max_transition 0.1 [get_ports {io_opcode[0]}]
set_max_transition 0.1 [get_ports {io_scalarOut[6]}]
set_max_transition 0.1 [get_ports {io_scalarOut[5]}]
set_max_transition 0.1 [get_ports {io_scalarOut[4]}]
set_max_transition 0.1 [get_ports {io_scalarOut[3]}]
set_max_transition 0.1 [get_ports {io_scalarOut[2]}]
set_max_transition 0.1 [get_ports {io_opA_local[3]}]
set_max_transition 0.1 [get_ports {io_opA_local[2]}]
set_max_transition 0.1 [get_ports {io_opA_local[1]}]
set_max_transition 0.1 [get_ports {io_opA_local[0]}]
set_max_transition 0.1 [get_ports {io_opcode[6]}]
set_max_transition 0.1 [get_ports {io_opcode[5]}]
set_max_transition 0.1 [get_ports {io_opcode[4]}]
set_max_transition 0.1 [get_ports {io_opcode[3]}]
set_max_transition 0.1 [get_ports {io_opA_remote[4]}]
set_max_transition 0.1 [get_ports {io_opA_remote[3]}]
set_max_transition 0.1 [get_ports {io_opA_remote[2]}]
set_max_transition 0.1 [get_ports {io_opA_remote[1]}]
set_max_transition 0.1 [get_ports {io_opA_remote[0]}]
set_max_transition 0.1 [get_ports {io_opA_local[6]}]
set_max_transition 0.1 [get_ports {io_opA_local[5]}]
set_max_transition 0.1 [get_ports {io_opA_local[4]}]
set_max_transition 0.1 [get_ports {io_opB_local[5]}]
set_max_transition 0.1 [get_ports {io_opB_local[4]}]
set_max_transition 0.1 [get_ports {io_opB_local[3]}]
set_max_transition 0.1 [get_ports {io_opB_local[2]}]
set_max_transition 0.1 [get_ports {io_opB_local[1]}]
set_max_transition 0.1 [get_ports {io_opB_local[0]}]
set_max_transition 0.1 [get_ports {io_opA_remote[6]}]
set_max_transition 0.1 [get_ports {io_opA_remote[5]}]
set_max_transition 0.1 [get_ports {io_opB_remote[6]}]
set_max_transition 0.1 [get_ports {io_opB_remote[5]}]
set_max_transition 0.1 [get_ports {io_opB_remote[4]}]
set_max_transition 0.1 [get_ports {io_opB_remote[3]}]
set_max_transition 0.1 [get_ports {io_opB_remote[2]}]
set_max_transition 0.1 [get_ports {io_opB_remote[1]}]
set_max_transition 0.1 [get_ports {io_opB_remote[0]}]
set_max_transition 0.1 [get_ports {io_opB_local[6]}]
set_max_transition 0.1 [get_ports {io_result[6]}]
set_max_transition 0.1 [get_ports {io_result[5]}]
set_max_transition 0.1 [get_ports {io_result[4]}]
set_max_transition 0.1 [get_ports {io_result[3]}]
set_max_transition 0.1 [get_ports {io_result[2]}]
set_max_transition 0.1 [get_ports {io_result[1]}]
set_max_transition 0.1 [get_ports {io_result[0]}]
set_max_transition 0.1 [get_ports io_opB_isLocal]
set_max_transition 0.1 [get_ports io_opA_isLocal]
set_max_transition 0.1 [get_ports io_rmux1]
set_max_transition 0.1 [get_ports io_rmux0]
set_max_transition 0.1 [get_ports io_done]
set_propagated_clock [get_ports clk]
create_clock [get_ports clk]  -name ideal_clock1  -period 1  -waveform {0 0.5}
set_max_delay 0.2  -from [list [get_ports clk] [get_ports reset] [get_ports io_enable]           \
[get_ports io_config_enable]]  -to [list [get_ports io_done] [get_ports {io_scalarOut[6]}] [get_ports        \
{io_scalarOut[5]}] [get_ports {io_scalarOut[4]}] [get_ports {io_scalarOut[3]}] \
[get_ports {io_scalarOut[2]}] [get_ports {io_scalarOut[1]}] [get_ports         \
{io_scalarOut[0]}] [get_ports io_rmux0] [get_ports io_rmux1] [get_ports        \
{io_opcode[6]}] [get_ports {io_opcode[5]}] [get_ports {io_opcode[4]}]          \
[get_ports {io_opcode[3]}] [get_ports {io_opcode[2]}] [get_ports               \
{io_opcode[1]}] [get_ports {io_opcode[0]}] [get_ports io_opA_isLocal]          \
[get_ports {io_opA_local[6]}] [get_ports {io_opA_local[5]}] [get_ports         \
{io_opA_local[4]}] [get_ports {io_opA_local[3]}] [get_ports {io_opA_local[2]}] \
[get_ports {io_opA_local[1]}] [get_ports {io_opA_local[0]}] [get_ports         \
{io_opA_remote[6]}] [get_ports {io_opA_remote[5]}] [get_ports                  \
{io_opA_remote[4]}] [get_ports {io_opA_remote[3]}] [get_ports                  \
{io_opA_remote[2]}] [get_ports {io_opA_remote[1]}] [get_ports                  \
{io_opA_remote[0]}] [get_ports io_opB_isLocal] [get_ports {io_opB_local[6]}]   \
[get_ports {io_opB_local[5]}] [get_ports {io_opB_local[4]}] [get_ports         \
{io_opB_local[3]}] [get_ports {io_opB_local[2]}] [get_ports {io_opB_local[1]}] \
[get_ports {io_opB_local[0]}] [get_ports {io_opB_remote[6]}] [get_ports        \
{io_opB_remote[5]}] [get_ports {io_opB_remote[4]}] [get_ports                  \
{io_opB_remote[3]}] [get_ports {io_opB_remote[2]}] [get_ports                  \
{io_opB_remote[1]}] [get_ports {io_opB_remote[0]}] [get_ports {io_result[6]}]  \
[get_ports {io_result[5]}] [get_ports {io_result[4]}] [get_ports               \
{io_result[3]}] [get_ports {io_result[2]}] [get_ports {io_result[1]}]          \
[get_ports {io_result[0]}]]
set_load -max 0.00163879  [get_nets n4]
set_load -min 0.00144983  [get_nets n4]
set_resistance -max 0.0597144  [get_nets n4]
set_resistance -min 0.227821  [get_nets n4]
set_load -max 0.00104849  [get_nets n5]
set_load -min 0.000851268  [get_nets n5]
set_resistance -max 0.0308722  [get_nets n5]
set_resistance -min 0.110437  [get_nets n5]
set_load -max 1.71768e-05  [get_nets n6]
set_load -min 1.57294e-05  [get_nets n6]
set_resistance -max 0.000451345  [get_nets n6]
set_resistance -min 0.000614613  [get_nets n6]
set_load -max 0.000300807  [get_nets n8]
set_load -min 0.000260693  [get_nets n8]
set_resistance -max 0.00963863  [get_nets n8]
set_resistance -min 0.0357365  [get_nets n8]
set_load -max 0.000990588  [get_nets n10]
set_load -min 0.000858688  [get_nets n10]
set_resistance -max 0.0289396  [get_nets n10]
set_resistance -min 0.0848815  [get_nets n10]
set_load -max 0.000150431  [get_nets n21]
set_load -min 0.000141674  [get_nets n21]
set_resistance -max 0.00756986  [get_nets n21]
set_resistance -min 0.0327788  [get_nets n21]
set_load -max 0.000228473  [get_nets n16]
set_load -min 0.000205704  [get_nets n16]
set_resistance -max 0.00865051  [get_nets n16]
set_resistance -min 0.0343283  [get_nets n16]
set_load -max 0.000232988  [get_nets n3]
set_load -min 0.00020768  [get_nets n3]
set_resistance -max 0.0104567  [get_nets n3]
set_resistance -min 0.0591099  [get_nets n3]
set_load -max 0.000264324  [get_nets n207]
set_load -min 0.000245673  [get_nets n207]
set_resistance -max 0.0104858  [get_nets n207]
set_resistance -min 0.0368018  [get_nets n207]
set_load -max 0.000120162  [get_nets n208]
set_load -min 0.00010306  [get_nets n208]
set_resistance -max 0.00648798  [get_nets n208]
set_resistance -min 0.0313546  [get_nets n208]
set_load -max 0.000732876  [get_nets n204]
set_load -min 0.000659086  [get_nets n204]
set_resistance -max 0.0308331  [get_nets n204]
set_resistance -min 0.12082  [get_nets n204]
set_load -max 0.000940355  [get_nets n206]
set_load -min 0.000792937  [get_nets n206]
set_resistance -max 0.0304542  [get_nets n206]
set_resistance -min 0.109464  [get_nets n206]
set_load -max 0.000560361  [get_nets n205]
set_load -min 0.00049263  [get_nets n205]
set_resistance -max 0.0246315  [get_nets n205]
set_resistance -min 0.101072  [get_nets n205]
set_load -max 0.000914652  [get_nets n224]
set_load -min 0.000781624  [get_nets n224]
set_resistance -max 0.0313035  [get_nets n224]
set_resistance -min 0.12175  [get_nets n224]
set_load -max 0.000697246  [get_nets n195]
set_load -min 0.000637173  [get_nets n195]
set_resistance -max 0.0308571  [get_nets n195]
set_resistance -min 0.120845  [get_nets n195]
set_load -max 0.000660254  [get_nets n197]
set_load -min 0.000562692  [get_nets n197]
set_resistance -max 0.0201929  [get_nets n197]
set_resistance -min 0.0727616  [get_nets n197]
set_load -max 0.000159767  [get_nets n196]
set_load -min 0.000142144  [get_nets n196]
set_resistance -max 0.0074924  [get_nets n196]
set_resistance -min 0.0326995  [get_nets n196]
set_load -max 0.0017541  [get_nets n194]
set_load -min 0.00149277  [get_nets n194]
set_resistance -max 0.0502866  [get_nets n194]
set_resistance -min 0.148121  [get_nets n194]
set_load -max 0.000397411  [get_nets n193]
set_load -min 0.000351488  [get_nets n193]
set_resistance -max 0.017786  [get_nets n193]
set_resistance -min 0.0692689  [get_nets n193]
set_load -max 0.000228256  [get_nets n192]
set_load -min 0.000202692  [get_nets n192]
set_resistance -max 0.011565  [get_nets n192]
set_resistance -min 0.0606558  [get_nets n192]
set_load -max 0.000191132  [get_nets n220]
set_load -min 0.000179898  [get_nets n220]
set_resistance -max 0.0114949  [get_nets n220]
set_resistance -min 0.0605789  [get_nets n220]
set_load -max 0.000226904  [get_nets n189]
set_load -min 0.000199076  [get_nets n189]
set_resistance -max 0.00854987  [get_nets n189]
set_resistance -min 0.0341584  [get_nets n189]
set_load -max 0.000653056  [get_nets counterChain_CounterRC_1_counter_reg__N7]
set_load -min 0.000607174  [get_nets counterChain_CounterRC_1_counter_reg__N7]
set_resistance -max 0.0251158  [get_nets counterChain_CounterRC_1_counter_reg__N7]
set_resistance -min 0.0793333  [get_nets counterChain_CounterRC_1_counter_reg__N7]
set_load -max 0.000512811  [get_nets counterChain_CounterRC_counter_reg__N7]
set_load -min 0.000469532  [get_nets counterChain_CounterRC_counter_reg__N7]
set_resistance -max 0.0220274  [get_nets counterChain_CounterRC_counter_reg__N7]
set_resistance -min 0.0751087  [get_nets counterChain_CounterRC_counter_reg__N7]
set_load -max 0.000152874  [get_nets n188]
set_load -min 0.000139142  [get_nets n188]
set_resistance -max 0.00745051  [get_nets n188]
set_resistance -min 0.0326598  [get_nets n188]
set_load -max 4.09278e-05  [get_nets n187]
set_load -min 3.62485e-05  [get_nets n187]
set_resistance -max 0.00101606  [get_nets n187]
set_resistance -min 0.00140467  [get_nets n187]
set_load -max 0.000650124  [get_nets n186]
set_load -min 0.000558598  [get_nets n186]
set_resistance -max 0.0217276  [get_nets n186]
set_resistance -min 0.0748499  [get_nets n186]
set_load -max 0.000278543  [get_nets n185]
set_load -min 0.000251386  [get_nets n185]
set_resistance -max 0.0155717  [get_nets n185]
set_resistance -min 0.0773448  [get_nets n185]
set_load -max 0.000828569  [get_nets n184]
set_load -min 0.000700342  [get_nets n184]
set_resistance -max 0.0294036  [get_nets n184]
set_resistance -min 0.10803  [get_nets n184]
set_load -max 0.000831757  [get_nets n265]
set_load -min 0.000738639  [get_nets n265]
set_resistance -max 0.0259904  [get_nets n265]
set_resistance -min 0.0806772  [get_nets n265]
set_load -max 0.000225738  [get_nets n202]
set_load -min 0.000213257  [get_nets n202]
set_resistance -max 0.0130228  [get_nets n202]
set_resistance -min 0.0626462  [get_nets n202]
set_load -max 1.01029e-05  [get_nets n267]
set_load -min 8.82593e-06  [get_nets n267]
set_resistance -max 0.00024998  [get_nets n267]
set_resistance -min 0.00034442  [get_nets n267]
set_load -max 0.000428184  [get_nets counterChain_CounterRC_counter_reg__N8]
set_load -min 0.00038195  [get_nets counterChain_CounterRC_counter_reg__N8]
set_resistance -max 0.0177701  [get_nets counterChain_CounterRC_counter_reg__N8]
set_resistance -min 0.0692285  [get_nets counterChain_CounterRC_counter_reg__N8]
set_load -max 0.00143758  [get_nets n234]
set_load -min 0.00122627  [get_nets n234]
set_resistance -max 0.0415876  [get_nets n234]
set_resistance -min 0.147241  [get_nets n234]
set_load -max 0.000814564  [get_nets n235]
set_load -min 0.000693769  [get_nets n235]
set_resistance -max 0.0280902  [get_nets n235]
set_resistance -min 0.106092  [get_nets n235]
set_load -max 0.000304811  [get_nets n233]
set_load -min 0.000274873  [get_nets n233]
set_resistance -max 0.0109658  [get_nets n233]
set_resistance -min 0.0375405  [get_nets n233]
set_load -max 0.000275523  [get_nets n230]
set_load -min 0.00024041  [get_nets n230]
set_resistance -max 0.0133049  [get_nets n230]
set_resistance -min 0.0631479  [get_nets n230]
set_load -max 0.000519175  [get_nets n229]
set_load -min 0.000459601  [get_nets n229]
set_resistance -max 0.0194864  [get_nets n229]
set_resistance -min 0.0716493  [get_nets n229]
set_load -max 0.000641385  [get_nets n212]
set_load -min 0.000569508  [get_nets n212]
set_resistance -max 0.0198624  [get_nets n212]
set_resistance -min 0.0721736  [get_nets n212]
set_load -max 0.000260606  [get_nets n227]
set_load -min 0.000213462  [get_nets n227]
set_resistance -max 0.00894108  [get_nets n227]
set_resistance -min 0.0348227  [get_nets n227]
set_load -max 0.00257607  [get_nets n228]
set_load -min 0.00215795  [get_nets n228]
set_resistance -max 0.0801326  [get_nets n228]
set_resistance -min 0.279517  [get_nets n228]
set_load -max 0.0035477  [get_nets {counterChain_io_data_0_out[1]}]
set_load -min 0.00301086  [get_nets {counterChain_io_data_0_out[1]}]
set_resistance -max 0.112915  [get_nets {counterChain_io_data_0_out[1]}]
set_resistance -min 0.402917  [get_nets {counterChain_io_data_0_out[1]}]
set_load -max 0.000926562  [get_nets n226]
set_load -min 0.000847374  [get_nets n226]
set_resistance -max 0.0399631  [get_nets n226]
set_resistance -min 0.155786  [get_nets n226]
set_load -max 0.000815944  [get_nets n231]
set_load -min 0.000696415  [get_nets n231]
set_resistance -max 0.0241948  [get_nets n231]
set_resistance -min 0.0782722  [get_nets n231]
set_load -max 0.00382068  [get_nets {counterChain_io_data_0_out[0]}]
set_load -min 0.00325056  [get_nets {counterChain_io_data_0_out[0]}]
set_resistance -max 0.123402  [get_nets {counterChain_io_data_0_out[0]}]
set_resistance -min 0.429061  [get_nets {counterChain_io_data_0_out[0]}]
set_load -max 0.000611126  [get_nets n225]
set_load -min 0.000512109  [get_nets n225]
set_resistance -max 0.0199849  [get_nets n225]
set_resistance -min 0.0725831  [get_nets n225]
set_load -max 0.000525117  [get_nets n222]
set_load -min 0.000464425  [get_nets n222]
set_resistance -max 0.0181636  [get_nets n222]
set_resistance -min 0.0697079  [get_nets n222]
set_load -max 0.00012335  [get_nets n221]
set_load -min 0.000110095  [get_nets n221]
set_resistance -max 0.00745301  [get_nets n221]
set_resistance -min 0.0326181  [get_nets n221]
set_load -max 0.000885621  [get_nets n266]
set_load -min 0.000792874  [get_nets n266]
set_resistance -max 0.0315218  [get_nets n266]
set_resistance -min 0.110568  [get_nets n266]
set_load -max 0.00147562  [get_nets counterChain_CounterRC_counter_reg__N6]
set_load -min 0.00135203  [get_nets counterChain_CounterRC_counter_reg__N6]
set_resistance -max 0.0441673  [get_nets counterChain_CounterRC_counter_reg__N6]
set_resistance -min 0.105636  [get_nets counterChain_CounterRC_counter_reg__N6]
set_load -max 0.000487197  [get_nets n219]
set_load -min 0.000393318  [get_nets n219]
set_resistance -max 0.0151379  [get_nets n219]
set_resistance -min 0.0658572  [get_nets n219]
set_load -max 0.000313739  [get_nets n218]
set_load -min 0.000275233  [get_nets n218]
set_resistance -max 0.0138785  [get_nets n218]
set_resistance -min 0.0639039  [get_nets n218]
set_load -max 0.00092778  [get_nets {counterChain_io_data_1_out[2]}]
set_load -min 0.000828234  [get_nets {counterChain_io_data_1_out[2]}]
set_resistance -max 0.0309598  [get_nets {counterChain_io_data_1_out[2]}]
set_resistance -min 0.0985956  [get_nets {counterChain_io_data_1_out[2]}]
set_load -max 0.000135767  [get_nets n217]
set_load -min 0.000124592  [get_nets n217]
set_resistance -max 0.00683643  [get_nets n217]
set_resistance -min 0.0317884  [get_nets n217]
set_load -max 0.000251624  [get_nets n215]
set_load -min 0.00022133  [get_nets n215]
set_resistance -max 0.00739478  [get_nets n215]
set_resistance -min 0.0325481  [get_nets n215]
set_load -max 0.000319936  [get_nets n216]
set_load -min 0.000281957  [get_nets n216]
set_resistance -max 0.0139269  [get_nets n216]
set_resistance -min 0.0639556  [get_nets n216]
set_load -max 0.00109256  [get_nets n191]
set_load -min 0.000976599  [get_nets n191]
set_resistance -max 0.0397168  [get_nets n191]
set_resistance -min 0.144347  [get_nets n191]
set_load -max 0.000119789  [get_nets n214]
set_load -min 0.000110383  [get_nets n214]
set_resistance -max 0.00977057  [get_nets n214]
set_resistance -min 0.0581688  [get_nets n214]
set_load -max 0.000344431  [get_nets n203]
set_load -min 0.000289832  [get_nets n203]
set_resistance -max 0.0143516  [get_nets n203]
set_resistance -min 0.0646125  [get_nets n203]
set_load -max 0.0021447  [get_nets n213]
set_load -min 0.00184172  [get_nets n213]
set_resistance -max 0.0678306  [get_nets n213]
set_resistance -min 0.228412  [get_nets n213]
set_load -max 0.000391564  [get_nets n199]
set_load -min 0.000336851  [get_nets n199]
set_resistance -max 0.0155044  [get_nets n199]
set_resistance -min 0.0661673  [get_nets n199]
set_load -max 0.00136454  [get_nets n232]
set_load -min 0.00116515  [get_nets n232]
set_resistance -max 0.0406634  [get_nets n232]
set_resistance -min 0.134807  [get_nets n232]
set_load -max 0.000373861  [get_nets n210]
set_load -min 0.000324015  [get_nets n210]
set_resistance -max 0.0149119  [get_nets n210]
set_resistance -min 0.0653933  [get_nets n210]
set_load -max 0.000347137  [get_nets n211]
set_load -min 0.000316722  [get_nets n211]
set_resistance -max 0.0154926  [get_nets n211]
set_resistance -min 0.066054  [get_nets n211]
set_load -max 0.000654693  [get_nets n209]
set_load -min 0.000615344  [get_nets n209]
set_resistance -max 0.0233553  [get_nets n209]
set_resistance -min 0.0768615  [get_nets n209]
set_load -max 0.00170186  [get_nets n263]
set_load -min 0.00148952  [get_nets n263]
set_resistance -max 0.0675535  [get_nets n263]
set_resistance -min 0.26123  [get_nets n263]
set_load -max 0.000602647  [get_nets N39]
set_load -min 0.000513753  [get_nets N39]
set_resistance -max 0.0202272  [get_nets N39]
set_resistance -min 0.072802  [get_nets N39]
set_load -max 0.00049377  [get_nets N63]
set_load -min 0.000442332  [get_nets N63]
set_resistance -max 0.014192  [get_nets N63]
set_resistance -min 0.0420624  [get_nets N63]
set_load -max 0.000685415  [get_nets N46]
set_load -min 0.000600452  [get_nets N46]
set_resistance -max 0.0225874  [get_nets N46]
set_resistance -min 0.0759794  [get_nets N46]
set_load -max 0.00281871  [get_nets n250]
set_load -min 0.00253869  [get_nets n250]
set_resistance -max 0.11075  [get_nets n250]
set_resistance -min 0.398999  [get_nets n250]
set_load -max 0.000461102  [get_nets n243]
set_load -min 0.000398744  [get_nets n243]
set_resistance -max 0.0200052  [get_nets n243]
set_resistance -min 0.0835218  [get_nets n243]
set_load -max 0.000442359  [get_nets counterChain_CounterRC_1_counter_reg__N6]
set_load -min 0.000387113  [get_nets counterChain_CounterRC_1_counter_reg__N6]
set_resistance -max 0.0174295  [get_nets counterChain_CounterRC_1_counter_reg__N6]
set_resistance -min 0.0687533  [get_nets counterChain_CounterRC_1_counter_reg__N6]
set_load -max 0.000883077  [get_nets n245]
set_load -min 0.000787888  [get_nets n245]
set_resistance -max 0.0356514  [get_nets n245]
set_resistance -min 0.13868  [get_nets n245]
set_load -max 0.000515969  [get_nets n244]
set_load -min 0.000435877  [get_nets n244]
set_resistance -max 0.0204823  [get_nets n244]
set_resistance -min 0.0843671  [get_nets n244]
set_load -max 0.00126182  [get_nets N57]
set_load -min 0.00112314  [get_nets N57]
set_resistance -max 0.0383691  [get_nets N57]
set_resistance -min 0.0977085  [get_nets N57]
set_load -max 0.000581205  [get_nets n240]
set_load -min 0.000519712  [get_nets n240]
set_resistance -max 0.0227067  [get_nets n240]
set_resistance -min 0.098347  [get_nets n240]
set_load -max 0.00131989  [get_nets {counterChain_io_data_1_out[0]}]
set_load -min 0.0011543  [get_nets {counterChain_io_data_1_out[0]}]
set_resistance -max 0.046583  [get_nets {counterChain_io_data_1_out[0]}]
set_resistance -min 0.165114  [get_nets {counterChain_io_data_1_out[0]}]
set_load -max 0.0011167  [get_nets n238]
set_load -min 0.000986699  [get_nets n238]
set_resistance -max 0.036751  [get_nets n238]
set_resistance -min 0.140202  [get_nets n238]
set_load -max 0.000307084  [get_nets counterChain_CounterRC_1_counter_reg__N8]
set_load -min 0.000276401  [get_nets counterChain_CounterRC_1_counter_reg__N8]
set_resistance -max 0.0148147  [get_nets counterChain_CounterRC_1_counter_reg__N8]
set_resistance -min 0.0651431  [get_nets counterChain_CounterRC_1_counter_reg__N8]
set_load -max 0.000278726  [get_nets n239]
set_load -min 0.000232379  [get_nets n239]
set_resistance -max 0.0128707  [get_nets n239]
set_resistance -min 0.0625556  [get_nets n239]
set_load -max 0.00039451  [get_nets n241]
set_load -min 0.000343889  [get_nets n241]
set_resistance -max 0.0174282  [get_nets n241]
set_resistance -min 0.0799658  [get_nets n241]
set_load -max 0.00144042  [get_nets n236]
set_load -min 0.00125249  [get_nets n236]
set_resistance -max 0.047935  [get_nets n236]
set_resistance -min 0.167065  [get_nets n236]
set_load -max 0.00152192  [get_nets {counterChain_io_data_1_out[1]}]
set_load -min 0.00133164  [get_nets {counterChain_io_data_1_out[1]}]
set_resistance -max 0.0537131  [get_nets {counterChain_io_data_1_out[1]}]
set_resistance -min 0.197473  [get_nets {counterChain_io_data_1_out[1]}]
set_load -max 0.00212581  [get_nets {counterChain_io_data_0_out[2]}]
set_load -min 0.00194214  [get_nets {counterChain_io_data_0_out[2]}]
set_resistance -max 0.0825484  [get_nets {counterChain_io_data_0_out[2]}]
set_resistance -min 0.292953  [get_nets {counterChain_io_data_0_out[2]}]
set_load -max 0.00457824  [get_nets io_config_enable]
set_load -min 0.00416457  [get_nets io_config_enable]
set_resistance -max 0.150797  [get_nets io_config_enable]
set_resistance -min 0.341876  [get_nets io_config_enable]
set_load -max 0.00305573  [get_nets io_enable]
set_load -min 0.00278303  [get_nets io_enable]
set_resistance -max 0.103884  [get_nets io_enable]
set_resistance -min 0.210238  [get_nets io_enable]
set_load -max 0.00258482  [get_nets reset]
set_load -min 0.00237749  [get_nets reset]
set_resistance -max 0.0895765  [get_nets reset]
set_resistance -min 0.179186  [get_nets reset]
set_load -max 0.007129  [get_nets clk]
set_load -min 0.00654152  [get_nets clk]
set_resistance -max 0.277621  [get_nets clk]
set_resistance -min 0.840406  [get_nets clk]
set_load -max 0.00451184  [get_nets {io_scalarOut[1]}]
set_load -min 0.0041962  [get_nets {io_scalarOut[1]}]
set_resistance -max 0.148306  [get_nets {io_scalarOut[1]}]
set_resistance -min 0.232036  [get_nets {io_scalarOut[1]}]
set_load -max 0.00502437  [get_nets {io_scalarOut[0]}]
set_load -min 0.0046613  [get_nets {io_scalarOut[0]}]
set_resistance -max 0.163507  [get_nets {io_scalarOut[0]}]
set_resistance -min 0.252954  [get_nets {io_scalarOut[0]}]
set_load -max 0.00246765  [get_nets {io_opcode[1]}]
set_load -min 0.00232428  [get_nets {io_opcode[1]}]
set_resistance -max 0.0816652  [get_nets {io_opcode[1]}]
set_resistance -min 0.140341  [get_nets {io_opcode[1]}]
set_load -max 0.0030454  [get_nets {io_scalarOut[5]}]
set_load -min 0.00284584  [get_nets {io_scalarOut[5]}]
set_resistance -max 0.0972649  [get_nets {io_scalarOut[5]}]
set_resistance -min 0.161771  [get_nets {io_scalarOut[5]}]
set_load -max 0.00353908  [get_nets {io_scalarOut[4]}]
set_load -min 0.00327835  [get_nets {io_scalarOut[4]}]
set_resistance -max 0.108265  [get_nets {io_scalarOut[4]}]
set_resistance -min 0.176936  [get_nets {io_scalarOut[4]}]
set_load -max 0.00356977  [get_nets {io_scalarOut[3]}]
set_load -min 0.00330159  [get_nets {io_scalarOut[3]}]
set_resistance -max 0.109788  [get_nets {io_scalarOut[3]}]
set_resistance -min 0.17902  [get_nets {io_scalarOut[3]}]
set_load -max 0.00400573  [get_nets {io_scalarOut[2]}]
set_load -min 0.00373065  [get_nets {io_scalarOut[2]}]
set_resistance -max 0.131887  [get_nets {io_scalarOut[2]}]
set_resistance -min 0.209442  [get_nets {io_scalarOut[2]}]
set_load -max 0.00317997  [get_nets {io_opB_remote[0]}]
set_load -min 0.00299089  [get_nets {io_opB_remote[0]}]
set_resistance -max 0.102371  [get_nets {io_opB_remote[0]}]
set_resistance -min 0.180044  [get_nets {io_opB_remote[0]}]
set_load -max 0.00452605  [get_nets {io_result[0]}]
set_load -min 0.00421534  [get_nets {io_result[0]}]
set_resistance -max 0.148004  [get_nets {io_result[0]}]
set_resistance -min 0.254001  [get_nets {io_result[0]}]
set_load -max 0.00794172  [get_nets io_rmux1]
set_load -min 0.00725361  [get_nets io_rmux1]
set_resistance -max 0.100219  [get_nets io_rmux1]
set_resistance -min 0.368744  [get_nets io_rmux1]
set_load -max 0.00325457  [get_nets io_done]
set_load -min 0.0030032  [get_nets io_done]
set_resistance -max 0.103724  [get_nets io_done]
set_resistance -min 0.159513  [get_nets io_done]
