###################################################################

# Created by write_sdc on Sat Aug  6 19:54:50 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_command]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_config_enable]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
reset]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
clk]
set_load -pin_load 0.19856 [get_ports io_status]
set_max_transition 0.1 [get_ports io_status]
set_propagated_clock [get_ports clk]
create_clock [get_ports clk]  -name ideal_clock4ghz  -period 0.3  -waveform {0 0.15}
set_max_delay 0.2  -from [list [get_ports clk] [get_ports reset] [get_ports io_config_enable]    \
[get_ports io_command]]  -to [get_ports io_status]
set_load -max 0.000418607  [get_nets n2]
set_load -min 0.000357585  [get_nets n2]
set_resistance -max 0.0183737  [get_nets n2]
set_resistance -min 0.0813688  [get_nets n2]
set_load -max 0.000612281  [get_nets cu0_T21_0_]
set_load -min 0.000553258  [get_nets cu0_T21_0_]
set_resistance -max 0.026283  [get_nets cu0_T21_0_]
set_resistance -min 0.103288  [get_nets cu0_T21_0_]
set_load -max 0.000219178  [get_nets n298]
set_load -min 0.000187791  [get_nets n298]
set_resistance -max 0.0113239  [get_nets n298]
set_resistance -min 0.0603594  [get_nets n298]
set_load -max 0.000858311  [get_nets clk_G1IP]
set_load -min 0.00081063  [get_nets clk_G1IP]
set_resistance -max 0.0334771  [get_nets clk_G1IP]
set_resistance -min 0.0963851  [get_nets clk_G1IP]
set_load -max 0.00393648  [get_nets io_config_enable]
set_load -min 0.00364168  [get_nets io_config_enable]
set_resistance -max 0.126761  [get_nets io_config_enable]
set_resistance -min 0.196793  [get_nets io_config_enable]
set_load -max 0.0061722  [get_nets reset]
set_load -min 0.00578525  [get_nets reset]
set_resistance -max 0.205775  [get_nets reset]
set_resistance -min 0.406328  [get_nets reset]
set_load -max 0.00408995  [get_nets clk]
set_load -min 0.00372315  [get_nets clk]
set_resistance -max 0.157862  [get_nets clk]
set_resistance -min 0.451914  [get_nets clk]
set_load -max 0.0214709  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net4415]
set_load -min 0.0193172  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net4415]
set_load -max 0.000314168  [get_nets cu1_RegisterBlock_1_FF_1_net4388]
set_load -min 0.000269491  [get_nets cu1_RegisterBlock_1_FF_1_net4388]
set_resistance -max 0.0106391  [get_nets cu1_RegisterBlock_1_FF_1_net4388]
set_resistance -min 0.037129  [get_nets cu1_RegisterBlock_1_FF_1_net4388]
set_load -max 0.0098157  [get_nets cu1_RegisterBlock_1_FF_1_net4415]
set_load -min 0.00889942  [get_nets cu1_RegisterBlock_1_FF_1_net4415]
set_load -max 0.000350729  [get_nets cu0_controlBlock_incXbar_net4496]
set_load -min 0.000330195  [get_nets cu0_controlBlock_incXbar_net4496]
set_resistance -max 0.0160506  [get_nets cu0_controlBlock_incXbar_net4496]
set_resistance -min 0.0668169  [get_nets cu0_controlBlock_incXbar_net4496]
set_load -max 0.000686977  [get_nets cu0_controlBlock_incXbar_net4499]
set_load -min 0.000613052  [get_nets cu0_controlBlock_incXbar_net4499]
set_resistance -max 0.0280352  [get_nets cu0_controlBlock_incXbar_net4499]
set_resistance -min 0.105736  [get_nets cu0_controlBlock_incXbar_net4499]
set_load -max 0.00408995  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_load -min 0.00372315  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_resistance -max 0.157862  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_resistance -min 0.451914  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_load -max 0.000350729  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_load -min 0.000330195  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_resistance -max 0.0160506  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_resistance -min 0.0668169  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_load -max 0.000686977  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_load -min 0.000613052  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_resistance -max 0.0280352  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_resistance -min 0.105736  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_load -max 0.000858311  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_load -min 0.00081063  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_resistance -max 0.0334771  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_resistance -min 0.0963851  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_load -max 0.000314168  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_load -min 0.000269491  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_resistance -max 0.0106391  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_resistance -min 0.037129  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_load -max 0.0098157  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/ENCLK]
set_load -min 0.00889942  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/ENCLK]
set_load -max 0.0061722  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_load -min 0.00578525  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_resistance -max 0.205775  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_resistance -min 0.406328  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_load -max 0.000858311  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_load -min 0.00081063  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_resistance -max 0.0334771  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_resistance -min 0.0963851  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_load -max 0.0214709  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
set_load -min 0.0193172  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
