###################################################################

# Created by write_sdc on Sat Aug  6 18:03:37 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_command]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
io_config_enable]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
reset]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports  \
clk]
set_load -pin_load 0.19856 [get_ports io_status]
set_max_transition 0.1 [get_ports io_status]
set_propagated_clock [get_ports clk]
create_clock [get_ports clk]  -name ideal_clock1  -period 0.5  -waveform {0 0.25}
set_max_delay 0.2  -from [list [get_ports clk] [get_ports reset] [get_ports io_config_enable]    \
[get_ports io_command]]  -to [get_ports io_status]
set_load -max 0.0042196  [get_nets n2]
set_load -min 0.00369213  [get_nets n2]
set_resistance -max 0.126493  [get_nets n2]
set_resistance -min 0.320263  [get_nets n2]
set_load -max 0.00683803  [get_nets n3]
set_load -min 0.00604566  [get_nets n3]
set_resistance -max 0.253867  [get_nets n3]
set_resistance -min 0.920646  [get_nets n3]
set_load -max 0.000772739  [get_nets n841]
set_load -min 0.000658317  [get_nets n841]
set_resistance -max 0.0231992  [get_nets n841]
set_resistance -min 0.0768793  [get_nets n841]
set_load -max 0.000299739  [get_nets n729]
set_load -min 0.000274575  [get_nets n729]
set_resistance -max 0.0140445  [get_nets n729]
set_resistance -min 0.0640629  [get_nets n729]
set_load -max 0.00144252  [get_nets n722]
set_load -min 0.00121442  [get_nets n722]
set_resistance -max 0.0359927  [get_nets n722]
set_resistance -min 0.0946784  [get_nets n722]
set_load -max 0.000480977  [get_nets n720]
set_load -min 0.00043566  [get_nets n720]
set_resistance -max 0.0187414  [get_nets n720]
set_resistance -min 0.0705047  [get_nets n720]
set_load -max 0.000360046  [get_nets n721]
set_load -min 0.000311501  [get_nets n721]
set_resistance -max 0.0150366  [get_nets n721]
set_resistance -min 0.0655179  [get_nets n721]
set_load -max 0.000294126  [get_nets n718]
set_load -min 0.000274898  [get_nets n718]
set_resistance -max 0.0109415  [get_nets n718]
set_resistance -min 0.0374386  [get_nets n718]
set_load -max 0.000196182  [get_nets n791]
set_load -min 0.000183074  [get_nets n791]
set_resistance -max 0.0117107  [get_nets n791]
set_resistance -min 0.0608405  [get_nets n791]
set_load -max 0.000457941  [get_nets n714]
set_load -min 0.000401078  [get_nets n714]
set_resistance -max 0.0221201  [get_nets n714]
set_resistance -min 0.0975764  [get_nets n714]
set_load -max 0.000680447  [get_nets n713]
set_load -min 0.000596591  [get_nets n713]
set_resistance -max 0.0273284  [get_nets n713]
set_resistance -min 0.104938  [get_nets n713]
set_load -max 0.000249723  [get_nets n756]
set_load -min 0.000234445  [get_nets n756]
set_resistance -max 0.00914981  [get_nets n756]
set_resistance -min 0.0349627  [get_nets n756]
set_load -max 0.000481725  [get_nets n755]
set_load -min 0.000420104  [get_nets n755]
set_resistance -max 0.0197822  [get_nets n755]
set_resistance -min 0.0832571  [get_nets n755]
set_load -max 0.000346812  [get_nets n751]
set_load -min 0.0003261  [get_nets n751]
set_resistance -max 0.0175598  [get_nets n751]
set_resistance -min 0.0800678  [get_nets n751]
set_load -max 0.00060056  [get_nets n752]
set_load -min 0.000545274  [get_nets n752]
set_resistance -max 0.0285059  [get_nets n752]
set_resistance -min 0.117552  [get_nets n752]
set_load -max 0.000411162  [get_nets n754]
set_load -min 0.000367991  [get_nets n754]
set_resistance -max 0.0189196  [get_nets n754]
set_resistance -min 0.0820113  [get_nets n754]
set_load -max 4.55008e-05  [get_nets cu1_RegisterBlock_FF_io_data_out_0_]
set_load -min 4.18344e-05  [get_nets cu1_RegisterBlock_FF_io_data_out_0_]
set_resistance -max 0.00105363  [get_nets cu1_RegisterBlock_FF_io_data_out_0_]
set_resistance -min 0.00146732  [get_nets cu1_RegisterBlock_FF_io_data_out_0_]
set_load -max 0.00126184  [get_nets cu1_RegisterBlock_FF_io_data_out_1_]
set_load -min 0.00107444  [get_nets cu1_RegisterBlock_FF_io_data_out_1_]
set_resistance -max 0.0338989  [get_nets cu1_RegisterBlock_FF_io_data_out_1_]
set_resistance -min 0.091816  [get_nets cu1_RegisterBlock_FF_io_data_out_1_]
set_load -max 0.000534208  [get_nets n750]
set_load -min 0.000473186  [get_nets n750]
set_resistance -max 0.024935  [get_nets n750]
set_resistance -min 0.112668  [get_nets n750]
set_load -max 0.00155474  [get_nets cu1_RegisterBlock_FF_io_data_out_2_]
set_load -min 0.00136504  [get_nets cu1_RegisterBlock_FF_io_data_out_2_]
set_resistance -max 0.0423095  [get_nets cu1_RegisterBlock_FF_io_data_out_2_]
set_resistance -min 0.103244  [get_nets cu1_RegisterBlock_FF_io_data_out_2_]
set_load -max 0.000537817  [get_nets cu1_counterChain_io_data_0_out_2_]
set_load -min 0.000484354  [get_nets cu1_counterChain_io_data_0_out_2_]
set_resistance -max 0.0206268  [get_nets cu1_counterChain_io_data_0_out_2_]
set_resistance -min 0.0731711  [get_nets cu1_counterChain_io_data_0_out_2_]
set_load -max 0.000606273  [get_nets cu0_RegisterBlock_FF_io_data_out_3_]
set_load -min 0.000561423  [get_nets cu0_RegisterBlock_FF_io_data_out_3_]
set_resistance -max 0.0238511  [get_nets cu0_RegisterBlock_FF_io_data_out_3_]
set_resistance -min 0.0775818  [get_nets cu0_RegisterBlock_FF_io_data_out_3_]
set_load -max 0.00116873  [get_nets n759]
set_load -min 0.00101816  [get_nets n759]
set_resistance -max 0.0400689  [get_nets n759]
set_resistance -min 0.14497  [get_nets n759]
set_load -max 0.000988088  [get_nets n758]
set_load -min 0.000876533  [get_nets n758]
set_resistance -max 0.0445198  [get_nets n758]
set_resistance -min 0.184512  [get_nets n758]
set_load -max 0.000450668  [get_nets n757]
set_load -min 0.000362952  [get_nets n757]
set_resistance -max 0.0169625  [get_nets n757]
set_resistance -min 0.0684139  [get_nets n757]
set_load -max 0.00189578  [get_nets n747]
set_load -min 0.00163436  [get_nets n747]
set_resistance -max 0.0591352  [get_nets n747]
set_resistance -min 0.193834  [get_nets n747]
set_load -max 0.00171692  [get_nets n816]
set_load -min 0.00148711  [get_nets n816]
set_resistance -max 0.0590514  [get_nets n816]
set_resistance -min 0.204813  [get_nets n816]
set_load -max 0.00102772  [get_nets n815]
set_load -min 0.000899893  [get_nets n815]
set_resistance -max 0.0299955  [get_nets n815]
set_resistance -min 0.0863325  [get_nets n815]
set_load -max 0.000813708  [get_nets n814]
set_load -min 0.000720834  [get_nets n814]
set_resistance -max 0.0245392  [get_nets n814]
set_resistance -min 0.0785659  [get_nets n814]
set_load -max 0.000210456  [get_nets n813]
set_load -min 0.000191416  [get_nets n813]
set_resistance -max 0.00907703  [get_nets n813]
set_resistance -min 0.0349094  [get_nets n813]
set_load -max 0.00028336  [get_nets n784]
set_load -min 0.000266312  [get_nets n784]
set_resistance -max 0.0136884  [get_nets n784]
set_resistance -min 0.0635584  [get_nets n784]
set_load -max 0.00065828  [get_nets n811]
set_load -min 0.000549129  [get_nets n811]
set_resistance -max 0.0226282  [get_nets n811]
set_resistance -min 0.0873561  [get_nets n811]
set_load -max 0.000432138  [get_nets n812]
set_load -min 0.000393263  [get_nets n812]
set_resistance -max 0.0228376  [get_nets n812]
set_resistance -min 0.109721  [get_nets n812]
set_load -max 0.000305719  [get_nets n840]
set_load -min 0.000277025  [get_nets n840]
set_resistance -max 0.0151081  [get_nets n840]
set_resistance -min 0.0655448  [get_nets n840]
set_load -max 0.00031633  [get_nets n803]
set_load -min 0.000279514  [get_nets n803]
set_resistance -max 0.0131632  [get_nets n803]
set_resistance -min 0.062876  [get_nets n803]
set_load -max 0.000298779  [get_nets n804]
set_load -min 0.000265804  [get_nets n804]
set_resistance -max 0.0118022  [get_nets n804]
set_resistance -min 0.0387706  [get_nets n804]
set_load -max 0.000784756  [get_nets n795]
set_load -min 0.000679378  [get_nets n795]
set_resistance -max 0.0292016  [get_nets n795]
set_resistance -min 0.129699  [get_nets n795]
set_load -max 0.000652154  [get_nets n794]
set_load -min 0.000562386  [get_nets n794]
set_resistance -max 0.0291202  [get_nets n794]
set_resistance -min 0.129664  [get_nets n794]
set_load -max 0.00074058  [get_nets n793]
set_load -min 0.000644756  [get_nets n793]
set_resistance -max 0.0253684  [get_nets n793]
set_resistance -min 0.0910882  [get_nets n793]
set_load -max 0.000576156  [get_nets n792]
set_load -min 0.000517511  [get_nets n792]
set_resistance -max 0.022014  [get_nets n792]
set_resistance -min 0.0862302  [get_nets n792]
set_load -max 0.000499102  [get_nets cu0_RegisterBlock_FF_io_data_out_0_]
set_load -min 0.000467715  [get_nets cu0_RegisterBlock_FF_io_data_out_0_]
set_resistance -max 0.0208507  [get_nets cu0_RegisterBlock_FF_io_data_out_0_]
set_resistance -min 0.0734536  [get_nets cu0_RegisterBlock_FF_io_data_out_0_]
set_load -max 0.000436884  [get_nets n788]
set_load -min 0.000374169  [get_nets n788]
set_resistance -max 0.018189  [get_nets n788]
set_resistance -min 0.0810836  [get_nets n788]
set_load -max 0.00137941  [get_nets cu0_RegisterBlock_FF_io_data_out_1_]
set_load -min 0.00115905  [get_nets cu0_RegisterBlock_FF_io_data_out_1_]
set_resistance -max 0.0360632  [get_nets cu0_RegisterBlock_FF_io_data_out_1_]
set_resistance -min 0.0951628  [get_nets cu0_RegisterBlock_FF_io_data_out_1_]
set_load -max 0.00062425  [get_nets n790]
set_load -min 0.000532985  [get_nets n790]
set_resistance -max 0.0236411  [get_nets n790]
set_resistance -min 0.0998788  [get_nets n790]
set_load -max 0.000839111  [get_nets n787]
set_load -min 0.000674731  [get_nets n787]
set_resistance -max 0.0275057  [get_nets n787]
set_resistance -min 0.105629  [get_nets n787]
set_load -max 0.000141755  [get_nets cu0_RegisterBlock_FF_io_data_out_2_]
set_load -min 0.000132272  [get_nets cu0_RegisterBlock_FF_io_data_out_2_]
set_resistance -max 0.00739541  [get_nets cu0_RegisterBlock_FF_io_data_out_2_]
set_resistance -min 0.032533  [get_nets cu0_RegisterBlock_FF_io_data_out_2_]
set_load -max 0.00019648  [get_nets cu0_counterChain_io_data_0_out_2_]
set_load -min 0.000177718  [get_nets cu0_counterChain_io_data_0_out_2_]
set_resistance -max 0.00856725  [get_nets cu0_counterChain_io_data_0_out_2_]
set_resistance -min 0.0341504  [get_nets cu0_counterChain_io_data_0_out_2_]
set_load -max 0.000360546  [get_nets n835]
set_load -min 0.00031115  [get_nets n835]
set_resistance -max 0.0150569  [get_nets n835]
set_resistance -min 0.0655053  [get_nets n835]
set_load -max 0.000597649  [get_nets n785]
set_load -min 0.000502907  [get_nets n785]
set_resistance -max 0.0177088  [get_nets n785]
set_resistance -min 0.0693381  [get_nets n785]
set_load -max 5.58528e-05  [get_nets n786]
set_load -min 4.9646e-05  [get_nets n786]
set_resistance -max 0.00127704  [get_nets n786]
set_resistance -min 0.00179959  [get_nets n786]
set_load -max 0.000275914  [get_nets n843]
set_load -min 0.000253186  [get_nets n843]
set_resistance -max 0.0135963  [get_nets n843]
set_resistance -min 0.0634276  [get_nets n843]
set_load -max 0.000409812  [get_nets cu1_RegisterBlock_FF_1_net3509]
set_load -min 0.000373369  [get_nets cu1_RegisterBlock_FF_1_net3509]
set_resistance -max 0.0170044  [get_nets cu1_RegisterBlock_FF_1_net3509]
set_resistance -min 0.0681146  [get_nets cu1_RegisterBlock_FF_1_net3509]
set_load -max 0.000719066  [get_nets cu0_RegisterBlock_FF_1_net3509]
set_load -min 0.000597594  [get_nets cu0_RegisterBlock_FF_1_net3509]
set_resistance -max 0.0214268  [get_nets cu0_RegisterBlock_FF_1_net3509]
set_resistance -min 0.0745851  [get_nets cu0_RegisterBlock_FF_1_net3509]
set_load -max 0.000387745  [get_nets cu1_RegisterBlock_FF_1_net3512]
set_load -min 0.00036361  [get_nets cu1_RegisterBlock_FF_1_net3512]
set_resistance -max 0.0132923  [get_nets cu1_RegisterBlock_FF_1_net3512]
set_resistance -min 0.040629  [get_nets cu1_RegisterBlock_FF_1_net3512]
set_load -max 0.000418704  [get_nets cu0_RegisterBlock_FF_1_net3512]
set_load -min 0.000350244  [get_nets cu0_RegisterBlock_FF_1_net3512]
set_resistance -max 0.0163126  [get_nets cu0_RegisterBlock_FF_1_net3512]
set_resistance -min 0.0674134  [get_nets cu0_RegisterBlock_FF_1_net3512]
set_load -max 0.00159046  [get_nets cu1_RegisterBlock_FF_1_net3515]
set_load -min 0.00149149  [get_nets cu1_RegisterBlock_FF_1_net3515]
set_resistance -max 0.0515991  [get_nets cu1_RegisterBlock_FF_1_net3515]
set_resistance -min 0.115727  [get_nets cu1_RegisterBlock_FF_1_net3515]
set_load -max 0.0013882  [get_nets cu0_RegisterBlock_FF_1_net3515]
set_load -min 0.00123629  [get_nets cu0_RegisterBlock_FF_1_net3515]
set_resistance -max 0.0422669  [get_nets cu0_RegisterBlock_FF_1_net3515]
set_resistance -min 0.102998  [get_nets cu0_RegisterBlock_FF_1_net3515]
set_load -max 0.000389587  [get_nets n845]
set_load -min 0.000338034  [get_nets n845]
set_resistance -max 0.0140143  [get_nets n845]
set_resistance -min 0.064018  [get_nets n845]
set_load -max 0.00323291  [get_nets cu0_T21_0_]
set_load -min 0.00281326  [get_nets cu0_T21_0_]
set_resistance -max 0.109009  [get_nets cu0_T21_0_]
set_resistance -min 0.363202  [get_nets cu0_T21_0_]
set_load -max 0.000377695  [get_nets n801]
set_load -min 0.00032413  [get_nets n801]
set_resistance -max 0.0113961  [get_nets n801]
set_resistance -min 0.0382105  [get_nets n801]
set_load -max 0.000607226  [get_nets n837]
set_load -min 0.000523494  [get_nets n837]
set_resistance -max 0.0200167  [get_nets n837]
set_resistance -min 0.0724357  [get_nets n837]
set_load -max 0.000966185  [get_nets n838]
set_load -min 0.000869361  [get_nets n838]
set_resistance -max 0.0326841  [get_nets n838]
set_resistance -min 0.112254  [get_nets n838]
set_load -max 0.00036932  [get_nets n839]
set_load -min 0.00032839  [get_nets n839]
set_resistance -max 0.0183127  [get_nets n839]
set_resistance -min 0.0811691  [get_nets n839]
set_load -max 0.00046264  [get_nets n836]
set_load -min 0.000380833  [get_nets n836]
set_resistance -max 0.0129249  [get_nets n836]
set_resistance -min 0.040416  [get_nets n836]
set_load -max 9.65939e-05  [get_nets n783]
set_load -min 8.49823e-05  [get_nets n783]
set_resistance -max 0.00598257  [get_nets n783]
set_resistance -min 0.030596  [get_nets n783]
set_load -max 0.000480039  [get_nets n846]
set_load -min 0.000412243  [get_nets n846]
set_resistance -max 0.0175378  [get_nets n846]
set_resistance -min 0.0689559  [get_nets n846]
set_load -max 0.00103506  [get_nets n832]
set_load -min 0.000900036  [get_nets n832]
set_resistance -max 0.0291237  [get_nets n832]
set_resistance -min 0.0851921  [get_nets n832]
set_load -max 0.000827583  [get_nets n833]
set_load -min 0.000717975  [get_nets n833]
set_resistance -max 0.0278982  [get_nets n833]
set_resistance -min 0.105616  [get_nets n833]
set_load -max 0.000559822  [get_nets n834]
set_load -min 0.000476786  [get_nets n834]
set_resistance -max 0.0217672  [get_nets n834]
set_resistance -min 0.0860257  [get_nets n834]
set_load -max 0.00118694  [get_nets n827]
set_load -min 0.00104477  [get_nets n827]
set_resistance -max 0.0447655  [get_nets n827]
set_resistance -min 0.173633  [get_nets n827]
set_load -max 0.00105495  [get_nets n748]
set_load -min 0.000930111  [get_nets n748]
set_resistance -max 0.0362426  [get_nets n748]
set_resistance -min 0.128405  [get_nets n748]
set_load -max 0.00109424  [get_nets n823]
set_load -min 0.000913998  [get_nets n823]
set_resistance -max 0.0303243  [get_nets n823]
set_resistance -min 0.0869179  [get_nets n823]
set_load -max 0.000463813  [get_nets n822]
set_load -min 0.000386821  [get_nets n822]
set_resistance -max 0.0156189  [get_nets n822]
set_resistance -min 0.0663802  [get_nets n822]
set_load -max 0.000309487  [get_nets n821]
set_load -min 0.000274567  [get_nets n821]
set_resistance -max 0.0125266  [get_nets n821]
set_resistance -min 0.0619725  [get_nets n821]
set_load -max 0.000311624  [get_nets n802]
set_load -min 0.000288446  [get_nets n802]
set_resistance -max 0.0108451  [get_nets n802]
set_resistance -min 0.0373307  [get_nets n802]
set_load -max 0.000510838  [get_nets n819]
set_load -min 0.000447244  [get_nets n819]
set_resistance -max 0.0204833  [get_nets n819]
set_resistance -min 0.0842162  [get_nets n819]
set_load -max 0.000510678  [get_nets n820]
set_load -min 0.00046125  [get_nets n820]
set_resistance -max 0.0237524  [get_nets n820]
set_resistance -min 0.0998262  [get_nets n820]
set_load -max 0.000470681  [get_nets n868]
set_load -min 0.000410173  [get_nets n868]
set_resistance -max 0.0184386  [get_nets n868]
set_resistance -min 0.0702373  [get_nets n868]
set_load -max 0.000466213  [get_nets n867]
set_load -min 0.00042286  [get_nets n867]
set_resistance -max 0.0182595  [get_nets n867]
set_resistance -min 0.0698726  [get_nets n867]
set_load -max 0.000859224  [get_nets n866]
set_load -min 0.000713085  [get_nets n866]
set_resistance -max 0.0236371  [get_nets n866]
set_resistance -min 0.077671  [get_nets n866]
set_load -max 0.000432065  [get_nets n753]
set_load -min 0.00036946  [get_nets n753]
set_resistance -max 0.0180372  [get_nets n753]
set_resistance -min 0.080757  [get_nets n753]
set_load -max 0.000524128  [get_nets cu0_RegisterBlock_FF_1_net3506]
set_load -min 0.000467372  [get_nets cu0_RegisterBlock_FF_1_net3506]
set_resistance -max 0.0193711  [get_nets cu0_RegisterBlock_FF_1_net3506]
set_resistance -min 0.0715126  [get_nets cu0_RegisterBlock_FF_1_net3506]
set_load -max 0.000315149  [get_nets n842]
set_load -min 0.00028325  [get_nets n842]
set_resistance -max 0.0110911  [get_nets n842]
set_resistance -min 0.0376456  [get_nets n842]
set_load -max 0.000765278  [get_nets n849]
set_load -min 0.000668604  [get_nets n849]
set_resistance -max 0.0191932  [get_nets n849]
set_resistance -min 0.0489888  [get_nets n849]
set_load -max 0.000768757  [get_nets n749]
set_load -min 0.000688094  [get_nets n749]
set_resistance -max 0.0362414  [get_nets n749]
set_resistance -min 0.161894  [get_nets n749]
set_load -max 0.00252333  [get_nets cu1_counterChain_io_data_1_out_2_]
set_load -min 0.00222294  [get_nets cu1_counterChain_io_data_1_out_2_]
set_resistance -max 0.0737193  [get_nets cu1_counterChain_io_data_1_out_2_]
set_resistance -min 0.157956  [get_nets cu1_counterChain_io_data_1_out_2_]
set_load -max 0.000644871  [get_nets n872]
set_load -min 0.00057747  [get_nets n872]
set_resistance -max 0.0251703  [get_nets n872]
set_resistance -min 0.101853  [get_nets n872]
set_load -max 0.00054998  [get_nets n870]
set_load -min 0.000509653  [get_nets n870]
set_resistance -max 0.0204896  [get_nets n870]
set_resistance -min 0.0729527  [get_nets n870]
set_load -max 0.00111066  [get_nets n869]
set_load -min 0.000958516  [get_nets n869]
set_resistance -max 0.0361757  [get_nets n869]
set_resistance -min 0.117137  [get_nets n869]
set_load -max 0.00438104  [get_nets cu0_counterChain_io_data_1_out_2_]
set_load -min 0.00395427  [get_nets cu0_counterChain_io_data_1_out_2_]
set_resistance -max 0.12296  [get_nets cu0_counterChain_io_data_1_out_2_]
set_resistance -min 0.225648  [get_nets cu0_counterChain_io_data_1_out_2_]
set_load -max 0.00117342  [get_nets cu0_counterChain_io_data_1_out_0_]
set_load -min 0.00107037  [get_nets cu0_counterChain_io_data_1_out_0_]
set_resistance -max 0.0502834  [get_nets cu0_counterChain_io_data_1_out_0_]
set_resistance -min 0.192299  [get_nets cu0_counterChain_io_data_1_out_0_]
set_load -max 0.00074691  [get_nets cu0_counterChain_io_data_1_out_1_]
set_load -min 0.000695451  [get_nets cu0_counterChain_io_data_1_out_1_]
set_resistance -max 0.0363708  [get_nets cu0_counterChain_io_data_1_out_1_]
set_resistance -min 0.139488  [get_nets cu0_counterChain_io_data_1_out_1_]
set_load -max 0.00261802  [get_nets n900]
set_load -min 0.00250867  [get_nets n900]
set_resistance -max 0.0852666  [get_nets n900]
set_resistance -min 0.173593  [get_nets n900]
set_load -max 0.00275857  [get_nets n899]
set_load -min 0.0026104  [get_nets n899]
set_resistance -max 0.0864465  [get_nets n899]
set_resistance -min 0.175028  [get_nets n899]
set_load -max 0.000455008  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3512]
set_load -min 0.000402708  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3512]
set_resistance -max 0.0134113  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3512]
set_resistance -min 0.0408406  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3512]
set_load -max 0.000811991  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3515]
set_load -min 0.000729806  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3515]
set_resistance -max 0.0276844  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3515]
set_resistance -min 0.0828097  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3515]
set_load -max 0.000470483  [get_nets cu0_counterChain_CounterRC_counter_reg__net3509]
set_load -min 0.000441552  [get_nets cu0_counterChain_CounterRC_counter_reg__net3509]
set_resistance -max 0.014952  [get_nets cu0_counterChain_CounterRC_counter_reg__net3509]
set_resistance -min 0.0429745  [get_nets cu0_counterChain_CounterRC_counter_reg__net3509]
set_load -max 0.000344014  [get_nets n898]
set_load -min 0.000297355  [get_nets n898]
set_resistance -max 0.0143888  [get_nets n898]
set_resistance -min 0.0646086  [get_nets n898]
set_load -max 0.00105685  [get_nets n897]
set_load -min 0.000946407  [get_nets n897]
set_resistance -max 0.0387715  [get_nets n897]
set_resistance -min 0.131856  [get_nets n897]
set_load -max 0.00112048  [get_nets cu0_counterChain_io_data_0_out_0_]
set_load -min 0.00100818  [get_nets cu0_counterChain_io_data_0_out_0_]
set_resistance -max 0.04867  [get_nets cu0_counterChain_io_data_0_out_0_]
set_resistance -min 0.190118  [get_nets cu0_counterChain_io_data_0_out_0_]
set_load -max 0.00148075  [get_nets cu0_counterChain_io_data_0_out_1_]
set_load -min 0.00137087  [get_nets cu0_counterChain_io_data_0_out_1_]
set_resistance -max 0.052302  [get_nets cu0_counterChain_io_data_0_out_1_]
set_resistance -min 0.150457  [get_nets cu0_counterChain_io_data_0_out_1_]
set_load -max 0.00135428  [get_nets n896]
set_load -min 0.00122709  [get_nets n896]
set_resistance -max 0.0490309  [get_nets n896]
set_resistance -min 0.134646  [get_nets n896]
set_load -max 0.00155476  [get_nets n895]
set_load -min 0.00140457  [get_nets n895]
set_resistance -max 0.054315  [get_nets n895]
set_resistance -min 0.130836  [get_nets n895]
set_load -max 0.0014978  [get_nets cu0_counterChain_CounterRC_counter_reg__net3512]
set_load -min 0.00135785  [get_nets cu0_counterChain_CounterRC_counter_reg__net3512]
set_resistance -max 0.043047  [get_nets cu0_counterChain_CounterRC_counter_reg__net3512]
set_resistance -min 0.104007  [get_nets cu0_counterChain_CounterRC_counter_reg__net3512]
set_load -max 0.000785917  [get_nets cu0_counterChain_CounterRC_counter_reg__net3515]
set_load -min 0.000682824  [get_nets cu0_counterChain_CounterRC_counter_reg__net3515]
set_resistance -max 0.0241  [get_nets cu0_counterChain_CounterRC_counter_reg__net3515]
set_resistance -min 0.0781312  [get_nets cu0_counterChain_CounterRC_counter_reg__net3515]
set_load -max 0.00178136  [get_nets n894]
set_load -min 0.00158361  [get_nets n894]
set_resistance -max 0.059102  [get_nets n894]
set_resistance -min 0.137557  [get_nets n894]
set_load -max 0.00175084  [get_nets n923]
set_load -min 0.00150156  [get_nets n923]
set_resistance -max 0.0514301  [get_nets n923]
set_resistance -min 0.160917  [get_nets n923]
set_load -max 0.00101461  [get_nets n922]
set_load -min 0.000870489  [get_nets n922]
set_resistance -max 0.039239  [get_nets n922]
set_resistance -min 0.166221  [get_nets n922]
set_load -max 0.00193888  [get_nets n921]
set_load -min 0.00164794  [get_nets n921]
set_resistance -max 0.061498  [get_nets n921]
set_resistance -min 0.208566  [get_nets n921]
set_load -max 0.00147184  [get_nets n920]
set_load -min 0.00128484  [get_nets n920]
set_resistance -max 0.0502167  [get_nets n920]
set_resistance -min 0.170274  [get_nets n920]
set_load -max 0.000917133  [get_nets n1433]
set_load -min 0.000803571  [get_nets n1433]
set_resistance -max 0.0358171  [get_nets n1433]
set_resistance -min 0.127762  [get_nets n1433]
set_load -max 0.00144654  [get_nets n1432]
set_load -min 0.00130301  [get_nets n1432]
set_resistance -max 0.0558182  [get_nets n1432]
set_resistance -min 0.188723  [get_nets n1432]
set_load -max 0.00147597  [get_nets n919]
set_load -min 0.00130149  [get_nets n919]
set_resistance -max 0.0512928  [get_nets n919]
set_resistance -min 0.182529  [get_nets n919]
set_load -max 0.000797584  [get_nets n918]
set_load -min 0.000680505  [get_nets n918]
set_resistance -max 0.0293517  [get_nets n918]
set_resistance -min 0.11896  [get_nets n918]
set_load -max 0.0016771  [get_nets n917]
set_load -min 0.00150552  [get_nets n917]
set_resistance -max 0.0520788  [get_nets n917]
set_resistance -min 0.150143  [get_nets n917]
set_load -max 0.00135763  [get_nets n916]
set_load -min 0.00118248  [get_nets n916]
set_resistance -max 0.048874  [get_nets n916]
set_resistance -min 0.179446  [get_nets n916]
set_load -max 0.00103811  [get_nets n915]
set_load -min 0.000899705  [get_nets n915]
set_resistance -max 0.0345658  [get_nets n915]
set_resistance -min 0.126129  [get_nets n915]
set_load -max 0.00110763  [get_nets n914]
set_load -min 0.000968745  [get_nets n914]
set_resistance -max 0.0414633  [get_nets n914]
set_resistance -min 0.158074  [get_nets n914]
set_load -max 0.000890549  [get_nets n1431]
set_load -min 0.000756104  [get_nets n1431]
set_resistance -max 0.0348531  [get_nets n1431]
set_resistance -min 0.137846  [get_nets n1431]
set_load -max 0.000583568  [get_nets n1430]
set_load -min 0.000492346  [get_nets n1430]
set_resistance -max 0.0180305  [get_nets n1430]
set_resistance -min 0.0698894  [get_nets n1430]
set_load -max 0.00161993  [get_nets n913]
set_load -min 0.00138352  [get_nets n913]
set_resistance -max 0.053121  [get_nets n913]
set_resistance -min 0.185387  [get_nets n913]
set_load -max 0.00111064  [get_nets n912]
set_load -min 0.000967126  [get_nets n912]
set_resistance -max 0.0396963  [get_nets n912]
set_resistance -min 0.144451  [get_nets n912]
set_load -max 0.000265043  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3509]
set_load -min 0.00024974  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3509]
set_resistance -max 0.0106791  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3509]
set_resistance -min 0.0370762  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3509]
set_load -max 0.000320026  [get_nets n911]
set_load -min 0.000300891  [get_nets n911]
set_resistance -max 0.0155333  [get_nets n911]
set_resistance -min 0.0660793  [get_nets n911]
set_load -max 0.00161228  [get_nets n910]
set_load -min 0.00139343  [get_nets n910]
set_resistance -max 0.0520611  [get_nets n910]
set_resistance -min 0.172615  [get_nets n910]
set_load -max 0.00160238  [get_nets cu1_counterChain_io_data_1_out_0_]
set_load -min 0.00147046  [get_nets cu1_counterChain_io_data_1_out_0_]
set_resistance -max 0.0597153  [get_nets cu1_counterChain_io_data_1_out_0_]
set_resistance -min 0.183158  [get_nets cu1_counterChain_io_data_1_out_0_]
set_load -max 0.000725352  [get_nets cu1_counterChain_io_data_1_out_1_]
set_load -min 0.000647709  [get_nets cu1_counterChain_io_data_1_out_1_]
set_resistance -max 0.0358209  [get_nets cu1_counterChain_io_data_1_out_1_]
set_resistance -min 0.150118  [get_nets cu1_counterChain_io_data_1_out_1_]
set_load -max 0.00200064  [get_nets n909]
set_load -min 0.00188153  [get_nets n909]
set_resistance -max 0.0650865  [get_nets n909]
set_resistance -min 0.156904  [get_nets n909]
set_load -max 0.0019954  [get_nets n908]
set_load -min 0.00181691  [get_nets n908]
set_resistance -max 0.070054  [get_nets n908]
set_resistance -min 0.174743  [get_nets n908]
set_load -max 0.000566702  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3512]
set_load -min 0.000511283  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3512]
set_resistance -max 0.0213634  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3512]
set_resistance -min 0.0741574  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3512]
set_load -max 0.00121016  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3515]
set_load -min 0.00110438  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3515]
set_resistance -max 0.0355044  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3515]
set_resistance -min 0.0936692  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3515]
set_load -max 0.00160747  [get_nets cu1_counterChain_CounterRC_counter_reg__net3509]
set_load -min 0.00143348  [get_nets cu1_counterChain_CounterRC_counter_reg__net3509]
set_resistance -max 0.047319  [get_nets cu1_counterChain_CounterRC_counter_reg__net3509]
set_resistance -min 0.110235  [get_nets cu1_counterChain_CounterRC_counter_reg__net3509]
set_load -max 0.000713669  [get_nets n907]
set_load -min 0.000603727  [get_nets n907]
set_resistance -max 0.0220221  [get_nets n907]
set_resistance -min 0.0752939  [get_nets n907]
set_load -max 0.00246524  [get_nets n906]
set_load -min 0.00220135  [get_nets n906]
set_resistance -max 0.0768306  [get_nets n906]
set_resistance -min 0.1961  [get_nets n906]
set_load -max 0.00163977  [get_nets cu1_counterChain_io_data_0_out_0_]
set_load -min 0.00151852  [get_nets cu1_counterChain_io_data_0_out_0_]
set_resistance -max 0.0631555  [get_nets cu1_counterChain_io_data_0_out_0_]
set_resistance -min 0.198872  [get_nets cu1_counterChain_io_data_0_out_0_]
set_load -max 0.00140655  [get_nets cu1_counterChain_io_data_0_out_1_]
set_load -min 0.00127763  [get_nets cu1_counterChain_io_data_0_out_1_]
set_resistance -max 0.054397  [get_nets cu1_counterChain_io_data_0_out_1_]
set_resistance -min 0.175716  [get_nets cu1_counterChain_io_data_0_out_1_]
set_load -max 0.00249859  [get_nets n905]
set_load -min 0.00235519  [get_nets n905]
set_resistance -max 0.0751455  [get_nets n905]
set_resistance -min 0.148345  [get_nets n905]
set_load -max 0.00224046  [get_nets n904]
set_load -min 0.00208296  [get_nets n904]
set_resistance -max 0.0785814  [get_nets n904]
set_resistance -min 0.186461  [get_nets n904]
set_load -max 0.000882738  [get_nets cu1_counterChain_CounterRC_counter_reg__net3512]
set_load -min 0.000836201  [get_nets cu1_counterChain_CounterRC_counter_reg__net3512]
set_resistance -max 0.02764  [get_nets cu1_counterChain_CounterRC_counter_reg__net3512]
set_resistance -min 0.0603995  [get_nets cu1_counterChain_CounterRC_counter_reg__net3512]
set_load -max 0.00126878  [get_nets cu1_counterChain_CounterRC_counter_reg__net3515]
set_load -min 0.00115471  [get_nets cu1_counterChain_CounterRC_counter_reg__net3515]
set_resistance -max 0.0378685  [get_nets cu1_counterChain_CounterRC_counter_reg__net3515]
set_resistance -min 0.0968339  [get_nets cu1_counterChain_CounterRC_counter_reg__net3515]
set_load -max 0.00157974  [get_nets cu1_counterChain_CounterRC_config__stride_0_]
set_load -min 0.00144029  [get_nets cu1_counterChain_CounterRC_config__stride_0_]
set_resistance -max 0.0570967  [get_nets cu1_counterChain_CounterRC_config__stride_0_]
set_resistance -min 0.179262  [get_nets cu1_counterChain_CounterRC_config__stride_0_]
set_load -max 0.00259021  [get_nets n903]
set_load -min 0.0022777  [get_nets n903]
set_resistance -max 0.0708976  [get_nets n903]
set_resistance -min 0.154152  [get_nets n903]
set_load -max 0.000732433  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3509]
set_load -min 0.000676695  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3509]
set_resistance -max 0.0268194  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3509]
set_resistance -min 0.0816279  [get_nets cu0_counterChain_CounterRC_1_counter_reg__net3509]
set_load -max 0.000243492  [get_nets n902]
set_load -min 0.000226319  [get_nets n902]
set_resistance -max 0.0100911  [get_nets n902]
set_resistance -min 0.03624  [get_nets n902]
set_load -max 0.00256819  [get_nets n901]
set_load -min 0.00237132  [get_nets n901]
set_resistance -max 0.0794689  [get_nets n901]
set_resistance -min 0.187706  [get_nets n901]
set_load -max 0.000721586  [get_nets n935]
set_load -min 0.000636661  [get_nets n935]
set_resistance -max 0.0280463  [get_nets n935]
set_resistance -min 0.117059  [get_nets n935]
set_load -max 0.000677611  [get_nets n934]
set_load -min 0.000563364  [get_nets n934]
set_resistance -max 0.0240316  [get_nets n934]
set_resistance -min 0.100338  [get_nets n934]
set_load -max 0.00138251  [get_nets n933]
set_load -min 0.00120917  [get_nets n933]
set_resistance -max 0.0539714  [get_nets n933]
set_resistance -min 0.208885  [get_nets n933]
set_load -max 0.00118759  [get_nets n932]
set_load -min 0.00103489  [get_nets n932]
set_resistance -max 0.0457941  [get_nets n932]
set_resistance -min 0.186425  [get_nets n932]
set_load -max 0.000770679  [get_nets n1437]
set_load -min 0.000649269  [get_nets n1437]
set_resistance -max 0.0274695  [get_nets n1437]
set_resistance -min 0.105253  [get_nets n1437]
set_load -max 0.000886432  [get_nets n1436]
set_load -min 0.000753661  [get_nets n1436]
set_resistance -max 0.0364942  [get_nets n1436]
set_resistance -min 0.15124  [get_nets n1436]
set_load -max 0.00149109  [get_nets n931]
set_load -min 0.00132039  [get_nets n931]
set_resistance -max 0.0484718  [get_nets n931]
set_resistance -min 0.156541  [get_nets n931]
set_load -max 0.00130406  [get_nets n930]
set_load -min 0.00112562  [get_nets n930]
set_resistance -max 0.0425423  [get_nets n930]
set_resistance -min 0.1485  [get_nets n930]
set_load -max 0.00129354  [get_nets n929]
set_load -min 0.00111223  [get_nets n929]
set_resistance -max 0.0402417  [get_nets n929]
set_resistance -min 0.134241  [get_nets n929]
set_load -max 0.00131168  [get_nets n928]
set_load -min 0.00111373  [get_nets n928]
set_resistance -max 0.0430686  [get_nets n928]
set_resistance -min 0.16047  [get_nets n928]
set_load -max 0.00055005  [get_nets n927]
set_load -min 0.000462632  [get_nets n927]
set_resistance -max 0.0220608  [get_nets n927]
set_resistance -min 0.0976821  [get_nets n927]
set_load -max 0.001327  [get_nets n926]
set_load -min 0.00113129  [get_nets n926]
set_resistance -max 0.0483832  [get_nets n926]
set_resistance -min 0.190028  [get_nets n926]
set_load -max 0.00121672  [get_nets n1435]
set_load -min 0.00105767  [get_nets n1435]
set_resistance -max 0.0398662  [get_nets n1435]
set_resistance -min 0.133507  [get_nets n1435]
set_load -max 0.0013076  [get_nets n1434]
set_load -min 0.00114208  [get_nets n1434]
set_resistance -max 0.0367656  [get_nets n1434]
set_resistance -min 0.106695  [get_nets n1434]
set_load -max 0.00161938  [get_nets n925]
set_load -min 0.00141027  [get_nets n925]
set_resistance -max 0.0519187  [get_nets n925]
set_resistance -min 0.183746  [get_nets n925]
set_load -max 0.00240364  [get_nets n924]
set_load -min 0.00212637  [get_nets n924]
set_resistance -max 0.0705839  [get_nets n924]
set_resistance -min 0.187274  [get_nets n924]
set_load -max 0.000408128  [get_nets cu0_mem0_N17]
set_load -min 0.000378759  [get_nets cu0_mem0_N17]
set_resistance -max 0.0173124  [get_nets cu0_mem0_N17]
set_resistance -min 0.0685773  [get_nets cu0_mem0_N17]
set_load -max 0.00022736  [get_nets cu0_mem0_N16]
set_load -min 0.000216984  [get_nets cu0_mem0_N16]
set_resistance -max 0.0127445  [get_nets cu0_mem0_N16]
set_resistance -min 0.0622587  [get_nets cu0_mem0_N16]
set_load -max 0.000211353  [get_nets cu0_mem0_N15]
set_load -min 0.000172448  [get_nets cu0_mem0_N15]
set_resistance -max 0.011839  [get_nets cu0_mem0_N15]
set_resistance -min 0.061124  [get_nets cu0_mem0_N15]
set_load -max 0.00769016  [get_nets n1]
set_load -min 0.00694696  [get_nets n1]
set_resistance -max 0.245333  [get_nets n1]
set_resistance -min 0.663005  [get_nets n1]
set_load -max 0.0102317  [get_nets clk_G1IP]
set_load -min 0.00942  [get_nets clk_G1IP]
set_resistance -max 0.379181  [get_nets clk_G1IP]
set_resistance -min 1.25473  [get_nets clk_G1IP]
set_load -max 0.00543639  [get_nets CTS_ideal_clock1_CTO_delay11]
set_load -min 0.00497001  [get_nets CTS_ideal_clock1_CTO_delay11]
set_resistance -max 0.0480539  [get_nets CTS_ideal_clock1_CTO_delay11]
set_resistance -min 0.279901  [get_nets CTS_ideal_clock1_CTO_delay11]
set_load -max 0.00504442  [get_nets io_config_enable]
set_load -min 0.00459302  [get_nets io_config_enable]
set_resistance -max 0.158934  [get_nets io_config_enable]
set_resistance -min 0.263639  [get_nets io_config_enable]
set_load -max 0.00293787  [get_nets reset]
set_load -min 0.00277604  [get_nets reset]
set_resistance -max 0.0952866  [get_nets reset]
set_resistance -min 0.164674  [get_nets reset]
set_load -max 0.00452205  [get_nets clk]
set_load -min 0.00412967  [get_nets clk]
set_resistance -max 0.0480943  [get_nets clk]
set_resistance -min 0.274316  [get_nets clk]
set_load -max 0.0145214  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3518]
set_load -min 0.0132873  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3518]
set_resistance -max 0.581428  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3518]
set_resistance -min 1.73979  [get_nets cu1_counterChain_CounterRC_1_counter_reg__net3518]
set_load -max 0.000193234  [get_nets cu0_RegisterBlock_1_FF_1_net3491]
set_load -min 0.000164269  [get_nets cu0_RegisterBlock_1_FF_1_net3491]
set_resistance -max 0.0100307  [get_nets cu0_RegisterBlock_1_FF_1_net3491]
set_resistance -min 0.0585611  [get_nets cu0_RegisterBlock_1_FF_1_net3491]
set_load -max 0.00257101  [get_nets cu0_controlBlock_incXbar_net3599]
set_load -min 0.00235226  [get_nets cu0_controlBlock_incXbar_net3599]
set_resistance -max 0.0843423  [get_nets cu0_controlBlock_incXbar_net3599]
set_resistance -min 0.183169  [get_nets cu0_controlBlock_incXbar_net3599]
set_load -max 0.00311857  [get_nets cu0_controlBlock_incXbar_net3602]
set_load -min 0.00284589  [get_nets cu0_controlBlock_incXbar_net3602]
set_resistance -max 0.101108  [get_nets cu0_controlBlock_incXbar_net3602]
set_resistance -min 0.222961  [get_nets cu0_controlBlock_incXbar_net3602]
set_load -max 0.000554702  [get_nets cu1_mem1_N30]
set_load -min 0.000507209  [get_nets cu1_mem1_N30]
set_resistance -max 0.0193803  [get_nets cu1_mem1_N30]
set_resistance -min 0.0714154  [get_nets cu1_mem1_N30]
set_load -max 0.000266166  [get_nets cu1_mem1_N29]
set_load -min 0.000239948  [get_nets cu1_mem1_N29]
set_resistance -max 0.0100626  [get_nets cu1_mem1_N29]
set_resistance -min 0.036257  [get_nets cu1_mem1_N29]
set_load -max 0.00070124  [get_nets cu1_mem1_N27]
set_load -min 0.000593327  [get_nets cu1_mem1_N27]
set_resistance -max 0.0205614  [get_nets cu1_mem1_N27]
set_resistance -min 0.0733112  [get_nets cu1_mem1_N27]
set_load -max 0.000307734  [get_nets cu1_mem1_N25]
set_load -min 0.000271266  [get_nets cu1_mem1_N25]
set_resistance -max 0.0127146  [get_nets cu1_mem1_N25]
set_resistance -min 0.0622302  [get_nets cu1_mem1_N25]
set_load -max 0.00103833  [get_nets cu1_mem1_N24]
set_load -min 0.000905893  [get_nets cu1_mem1_N24]
set_resistance -max 0.0290393  [get_nets cu1_mem1_N24]
set_resistance -min 0.0849821  [get_nets cu1_mem1_N24]
set_load -max 0.000370445  [get_nets cu1_mem1_N23]
set_load -min 0.000298613  [get_nets cu1_mem1_N23]
set_resistance -max 0.0146634  [get_nets cu1_mem1_N23]
set_resistance -min 0.0650943  [get_nets cu1_mem1_N23]
set_load -max 0.000344069  [get_nets cu1_mem1_N22]
set_load -min 0.00032017  [get_nets cu1_mem1_N22]
set_resistance -max 0.016345  [get_nets cu1_mem1_N22]
set_resistance -min 0.067216  [get_nets cu1_mem1_N22]
set_load -max 0.000841805  [get_nets cu1_mem1_N21]
set_load -min 0.000738054  [get_nets cu1_mem1_N21]
set_resistance -max 0.0252634  [get_nets cu1_mem1_N21]
set_resistance -min 0.0796826  [get_nets cu1_mem1_N21]
set_load -max 0.000741362  [get_nets cu1_mem1_N20]
set_load -min 0.000628684  [get_nets cu1_mem1_N20]
set_resistance -max 0.0223263  [get_nets cu1_mem1_N20]
set_resistance -min 0.0757617  [get_nets cu1_mem1_N20]
set_load -max 0.00089716  [get_nets cu1_mem1_N19]
set_load -min 0.000804176  [get_nets cu1_mem1_N19]
set_resistance -max 0.0288798  [get_nets cu1_mem1_N19]
set_resistance -min 0.0846631  [get_nets cu1_mem1_N19]
set_load -max 0.000515373  [get_nets cu1_mem1_N18]
set_load -min 0.000442838  [get_nets cu1_mem1_N18]
set_resistance -max 0.017652  [get_nets cu1_mem1_N18]
set_resistance -min 0.0691267  [get_nets cu1_mem1_N18]
set_load -max 0.000294805  [get_nets cu1_mem1_N17]
set_load -min 0.000267177  [get_nets cu1_mem1_N17]
set_resistance -max 0.0102396  [get_nets cu1_mem1_N17]
set_resistance -min 0.0364369  [get_nets cu1_mem1_N17]
set_load -max 0.000669695  [get_nets cu1_mem1_N16]
set_load -min 0.000571503  [get_nets cu1_mem1_N16]
set_resistance -max 0.0214527  [get_nets cu1_mem1_N16]
set_resistance -min 0.0745298  [get_nets cu1_mem1_N16]
set_load -max 0.000615467  [get_nets cu1_mem1_N15]
set_load -min 0.000567217  [get_nets cu1_mem1_N15]
set_resistance -max 0.0215095  [get_nets cu1_mem1_N15]
set_resistance -min 0.074294  [get_nets cu1_mem1_N15]
set_load -max 0.000219675  [get_nets cu0_mem0_N30]
set_load -min 0.000203863  [get_nets cu0_mem0_N30]
set_resistance -max 0.0124284  [get_nets cu0_mem0_N30]
set_resistance -min 0.0618229  [get_nets cu0_mem0_N30]
set_load -max 0.000318051  [get_nets cu0_mem0_N29]
set_load -min 0.000290433  [get_nets cu0_mem0_N29]
set_resistance -max 0.0105561  [get_nets cu0_mem0_N29]
set_resistance -min 0.0369024  [get_nets cu0_mem0_N29]
set_load -max 0.000212968  [get_nets cu0_mem0_N27]
set_load -min 0.000177548  [get_nets cu0_mem0_N27]
set_resistance -max 0.010111  [get_nets cu0_mem0_N27]
set_resistance -min 0.0586755  [get_nets cu0_mem0_N27]
set_load -max 0.000609573  [get_nets cu0_mem0_N25]
set_load -min 0.000539339  [get_nets cu0_mem0_N25]
set_resistance -max 0.0208723  [get_nets cu0_mem0_N25]
set_resistance -min 0.0735502  [get_nets cu0_mem0_N25]
set_load -max 0.000400452  [get_nets cu0_mem0_N24]
set_load -min 0.000362338  [get_nets cu0_mem0_N24]
set_resistance -max 0.0158576  [get_nets cu0_mem0_N24]
set_resistance -min 0.066599  [get_nets cu0_mem0_N24]
set_load -max 0.000436588  [get_nets cu0_mem0_N23]
set_load -min 0.000401273  [get_nets cu0_mem0_N23]
set_resistance -max 0.0141246  [get_nets cu0_mem0_N23]
set_resistance -min 0.0418293  [get_nets cu0_mem0_N23]
set_load -max 0.000395731  [get_nets cu0_mem0_N22]
set_load -min 0.000329102  [get_nets cu0_mem0_N22]
set_resistance -max 0.0152787  [get_nets cu0_mem0_N22]
set_resistance -min 0.0659343  [get_nets cu0_mem0_N22]
set_load -max 0.000203716  [get_nets cu0_mem0_N21]
set_load -min 0.000188972  [get_nets cu0_mem0_N21]
set_resistance -max 0.00860306  [get_nets cu0_mem0_N21]
set_resistance -min 0.034222  [get_nets cu0_mem0_N21]
set_load -max 0.000461633  [get_nets cu0_mem0_N20]
set_load -min 0.000419018  [get_nets cu0_mem0_N20]
set_resistance -max 0.0177974  [get_nets cu0_mem0_N20]
set_resistance -min 0.0691938  [get_nets cu0_mem0_N20]
set_load -max 0.000107529  [get_nets cu0_mem0_N19]
set_load -min 0.00010055  [get_nets cu0_mem0_N19]
set_resistance -max 0.00668198  [get_nets cu0_mem0_N19]
set_resistance -min 0.0315455  [get_nets cu0_mem0_N19]
set_load -max 0.000283079  [get_nets cu0_mem0_N18]
set_load -min 0.000263777  [get_nets cu0_mem0_N18]
set_resistance -max 0.0137778  [get_nets cu0_mem0_N18]
set_resistance -min 0.0636736  [get_nets cu0_mem0_N18]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_6_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_6_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_6_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_6_/CLK]
set_load -max 0.000203716  [get_nets cu0_mem1_clk_gate_mem_reg_6_/EN]
set_load -min 0.000188972  [get_nets cu0_mem1_clk_gate_mem_reg_6_/EN]
set_resistance -max 0.00860306  [get_nets cu0_mem1_clk_gate_mem_reg_6_/EN]
set_resistance -min 0.034222  [get_nets cu0_mem1_clk_gate_mem_reg_6_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_5_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_5_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_5_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_5_/CLK]
set_load -max 0.000461633  [get_nets cu0_mem1_clk_gate_mem_reg_5_/EN]
set_load -min 0.000419018  [get_nets cu0_mem1_clk_gate_mem_reg_5_/EN]
set_resistance -max 0.0177974  [get_nets cu0_mem1_clk_gate_mem_reg_5_/EN]
set_resistance -min 0.0691938  [get_nets cu0_mem1_clk_gate_mem_reg_5_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_4_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_4_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_4_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_4_/CLK]
set_load -max 0.000107529  [get_nets cu0_mem1_clk_gate_mem_reg_4_/EN]
set_load -min 0.00010055  [get_nets cu0_mem1_clk_gate_mem_reg_4_/EN]
set_resistance -max 0.00668198  [get_nets cu0_mem1_clk_gate_mem_reg_4_/EN]
set_resistance -min 0.0315455  [get_nets cu0_mem1_clk_gate_mem_reg_4_/EN]
set_load -max 0.000283079  [get_nets cu0_mem1_clk_gate_mem_reg_3_/EN]
set_load -min 0.000263777  [get_nets cu0_mem1_clk_gate_mem_reg_3_/EN]
set_resistance -max 0.0137778  [get_nets cu0_mem1_clk_gate_mem_reg_3_/EN]
set_resistance -min 0.0636736  [get_nets cu0_mem1_clk_gate_mem_reg_3_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_3_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_3_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_3_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_3_/CLK]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_2_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_2_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_2_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_2_/CLK]
set_load -max 0.000408128  [get_nets cu0_mem1_clk_gate_mem_reg_2_/EN]
set_load -min 0.000378759  [get_nets cu0_mem1_clk_gate_mem_reg_2_/EN]
set_resistance -max 0.0173124  [get_nets cu0_mem1_clk_gate_mem_reg_2_/EN]
set_resistance -min 0.0685773  [get_nets cu0_mem1_clk_gate_mem_reg_2_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_1_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_1_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_1_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_1_/CLK]
set_load -max 0.00022736  [get_nets cu0_mem1_clk_gate_mem_reg_1_/EN]
set_load -min 0.000216984  [get_nets cu0_mem1_clk_gate_mem_reg_1_/EN]
set_resistance -max 0.0127445  [get_nets cu0_mem1_clk_gate_mem_reg_1_/EN]
set_resistance -min 0.0622587  [get_nets cu0_mem1_clk_gate_mem_reg_1_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_0_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_0_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_0_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_0_/CLK]
set_load -max 0.000211353  [get_nets cu0_mem1_clk_gate_mem_reg_0_/EN]
set_load -min 0.000172448  [get_nets cu0_mem1_clk_gate_mem_reg_0_/EN]
set_resistance -max 0.011839  [get_nets cu0_mem1_clk_gate_mem_reg_0_/EN]
set_resistance -min 0.061124  [get_nets cu0_mem1_clk_gate_mem_reg_0_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_0_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_0_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_0_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_0_/CLK]
set_load -max 0.000615467  [get_nets cu1_mem0_clk_gate_mem_reg_0_/EN]
set_load -min 0.000567217  [get_nets cu1_mem0_clk_gate_mem_reg_0_/EN]
set_resistance -max 0.0215095  [get_nets cu1_mem0_clk_gate_mem_reg_0_/EN]
set_resistance -min 0.074294  [get_nets cu1_mem0_clk_gate_mem_reg_0_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_15_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_15_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_15_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_15_/CLK]
set_load -max 0.000219675  [get_nets cu0_mem1_clk_gate_mem_reg_15_/EN]
set_load -min 0.000203863  [get_nets cu0_mem1_clk_gate_mem_reg_15_/EN]
set_resistance -max 0.0124284  [get_nets cu0_mem1_clk_gate_mem_reg_15_/EN]
set_resistance -min 0.0618229  [get_nets cu0_mem1_clk_gate_mem_reg_15_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_14_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_14_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_14_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_14_/CLK]
set_load -max 0.000318051  [get_nets cu0_mem1_clk_gate_mem_reg_14_/EN]
set_load -min 0.000290433  [get_nets cu0_mem1_clk_gate_mem_reg_14_/EN]
set_resistance -max 0.0105561  [get_nets cu0_mem1_clk_gate_mem_reg_14_/EN]
set_resistance -min 0.0369024  [get_nets cu0_mem1_clk_gate_mem_reg_14_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_12_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_12_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_12_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_12_/CLK]
set_load -max 0.000212968  [get_nets cu0_mem1_clk_gate_mem_reg_12_/EN]
set_load -min 0.000177548  [get_nets cu0_mem1_clk_gate_mem_reg_12_/EN]
set_resistance -max 0.010111  [get_nets cu0_mem1_clk_gate_mem_reg_12_/EN]
set_resistance -min 0.0586755  [get_nets cu0_mem1_clk_gate_mem_reg_12_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_10_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_10_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_10_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_10_/CLK]
set_load -max 0.000609573  [get_nets cu0_mem1_clk_gate_mem_reg_10_/EN]
set_load -min 0.000539339  [get_nets cu0_mem1_clk_gate_mem_reg_10_/EN]
set_resistance -max 0.0208723  [get_nets cu0_mem1_clk_gate_mem_reg_10_/EN]
set_resistance -min 0.0735502  [get_nets cu0_mem1_clk_gate_mem_reg_10_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_9_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_9_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_9_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_9_/CLK]
set_load -max 0.000400452  [get_nets cu0_mem1_clk_gate_mem_reg_9_/EN]
set_load -min 0.000362338  [get_nets cu0_mem1_clk_gate_mem_reg_9_/EN]
set_resistance -max 0.0158576  [get_nets cu0_mem1_clk_gate_mem_reg_9_/EN]
set_resistance -min 0.066599  [get_nets cu0_mem1_clk_gate_mem_reg_9_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_8_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_8_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_8_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_8_/CLK]
set_load -max 0.000436588  [get_nets cu0_mem1_clk_gate_mem_reg_8_/EN]
set_load -min 0.000401273  [get_nets cu0_mem1_clk_gate_mem_reg_8_/EN]
set_resistance -max 0.0141246  [get_nets cu0_mem1_clk_gate_mem_reg_8_/EN]
set_resistance -min 0.0418293  [get_nets cu0_mem1_clk_gate_mem_reg_8_/EN]
set_load -max 0.0102317  [get_nets cu0_mem1_clk_gate_mem_reg_7_/CLK]
set_load -min 0.00942  [get_nets cu0_mem1_clk_gate_mem_reg_7_/CLK]
set_resistance -max 0.379181  [get_nets cu0_mem1_clk_gate_mem_reg_7_/CLK]
set_resistance -min 1.25473  [get_nets cu0_mem1_clk_gate_mem_reg_7_/CLK]
set_load -max 0.000395731  [get_nets cu0_mem1_clk_gate_mem_reg_7_/EN]
set_load -min 0.000329102  [get_nets cu0_mem1_clk_gate_mem_reg_7_/EN]
set_resistance -max 0.0152787  [get_nets cu0_mem1_clk_gate_mem_reg_7_/EN]
set_resistance -min 0.0659343  [get_nets cu0_mem1_clk_gate_mem_reg_7_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_8_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_8_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_8_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_8_/CLK]
set_load -max 0.000370445  [get_nets cu1_mem0_clk_gate_mem_reg_8_/EN]
set_load -min 0.000298613  [get_nets cu1_mem0_clk_gate_mem_reg_8_/EN]
set_resistance -max 0.0146634  [get_nets cu1_mem0_clk_gate_mem_reg_8_/EN]
set_resistance -min 0.0650943  [get_nets cu1_mem0_clk_gate_mem_reg_8_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_7_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_7_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_7_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_7_/CLK]
set_load -max 0.000344069  [get_nets cu1_mem0_clk_gate_mem_reg_7_/EN]
set_load -min 0.00032017  [get_nets cu1_mem0_clk_gate_mem_reg_7_/EN]
set_resistance -max 0.016345  [get_nets cu1_mem0_clk_gate_mem_reg_7_/EN]
set_resistance -min 0.067216  [get_nets cu1_mem0_clk_gate_mem_reg_7_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_6_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_6_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_6_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_6_/CLK]
set_load -max 0.000841805  [get_nets cu1_mem0_clk_gate_mem_reg_6_/EN]
set_load -min 0.000738054  [get_nets cu1_mem0_clk_gate_mem_reg_6_/EN]
set_resistance -max 0.0252634  [get_nets cu1_mem0_clk_gate_mem_reg_6_/EN]
set_resistance -min 0.0796826  [get_nets cu1_mem0_clk_gate_mem_reg_6_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_5_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_5_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_5_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_5_/CLK]
set_load -max 0.000741362  [get_nets cu1_mem0_clk_gate_mem_reg_5_/EN]
set_load -min 0.000628684  [get_nets cu1_mem0_clk_gate_mem_reg_5_/EN]
set_resistance -max 0.0223263  [get_nets cu1_mem0_clk_gate_mem_reg_5_/EN]
set_resistance -min 0.0757617  [get_nets cu1_mem0_clk_gate_mem_reg_5_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_4_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_4_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_4_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_4_/CLK]
set_load -max 0.00089716  [get_nets cu1_mem0_clk_gate_mem_reg_4_/EN]
set_load -min 0.000804176  [get_nets cu1_mem0_clk_gate_mem_reg_4_/EN]
set_resistance -max 0.0288798  [get_nets cu1_mem0_clk_gate_mem_reg_4_/EN]
set_resistance -min 0.0846631  [get_nets cu1_mem0_clk_gate_mem_reg_4_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_3_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_3_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_3_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_3_/CLK]
set_load -max 0.000515373  [get_nets cu1_mem0_clk_gate_mem_reg_3_/EN]
set_load -min 0.000442838  [get_nets cu1_mem0_clk_gate_mem_reg_3_/EN]
set_resistance -max 0.017652  [get_nets cu1_mem0_clk_gate_mem_reg_3_/EN]
set_resistance -min 0.0691267  [get_nets cu1_mem0_clk_gate_mem_reg_3_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_2_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_2_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_2_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_2_/CLK]
set_load -max 0.000294805  [get_nets cu1_mem0_clk_gate_mem_reg_2_/EN]
set_load -min 0.000267177  [get_nets cu1_mem0_clk_gate_mem_reg_2_/EN]
set_resistance -max 0.0102396  [get_nets cu1_mem0_clk_gate_mem_reg_2_/EN]
set_resistance -min 0.0364369  [get_nets cu1_mem0_clk_gate_mem_reg_2_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_1_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_1_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_1_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_1_/CLK]
set_load -max 0.000669695  [get_nets cu1_mem0_clk_gate_mem_reg_1_/EN]
set_load -min 0.000571503  [get_nets cu1_mem0_clk_gate_mem_reg_1_/EN]
set_resistance -max 0.0214527  [get_nets cu1_mem0_clk_gate_mem_reg_1_/EN]
set_resistance -min 0.0745298  [get_nets cu1_mem0_clk_gate_mem_reg_1_/EN]
set_load -max 0.00769016  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_load -min 0.00694696  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_resistance -max 0.245333  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_resistance -min 0.663005  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/EN]
set_load -max 0.00543639  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_load -min 0.00497001  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_resistance -max 0.0480539  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_resistance -min 0.279901  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/CLK]
set_load -max 0.0145214  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
set_load -min 0.0132873  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
set_resistance -max 0.581428  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
set_resistance -min 1.73979  [get_nets cu1_counterChain_CounterRC_1_counter_reg__clk_gate_ff_reg/ENCLK]
set_load -max 0.0102317  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_load -min 0.00942  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_resistance -max 0.379181  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_resistance -min 1.25473  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/CLK]
set_load -max 0.000193234  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_load -min 0.000164269  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_resistance -max 0.0100307  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_resistance -min 0.0585611  [get_nets cu1_RegisterBlock_1_FF_1_clk_gate_ff_reg/EN]
set_load -max 0.00543639  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_load -min 0.00497001  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_resistance -max 0.0480539  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_resistance -min 0.279901  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/CLK]
set_load -max 0.00257101  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_load -min 0.00235226  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_resistance -max 0.0843423  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_resistance -min 0.183169  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/EN]
set_load -max 0.00311857  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_load -min 0.00284589  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_resistance -max 0.101108  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_resistance -min 0.222961  [get_nets cu0_controlBlock_incXbar_clk_gate_config__outSelect_3_reg/ENCLK]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_15_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_15_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_15_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_15_/CLK]
set_load -max 0.000554702  [get_nets cu1_mem0_clk_gate_mem_reg_15_/EN]
set_load -min 0.000507209  [get_nets cu1_mem0_clk_gate_mem_reg_15_/EN]
set_resistance -max 0.0193803  [get_nets cu1_mem0_clk_gate_mem_reg_15_/EN]
set_resistance -min 0.0714154  [get_nets cu1_mem0_clk_gate_mem_reg_15_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_14_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_14_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_14_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_14_/CLK]
set_load -max 0.000266166  [get_nets cu1_mem0_clk_gate_mem_reg_14_/EN]
set_load -min 0.000239948  [get_nets cu1_mem0_clk_gate_mem_reg_14_/EN]
set_resistance -max 0.0100626  [get_nets cu1_mem0_clk_gate_mem_reg_14_/EN]
set_resistance -min 0.036257  [get_nets cu1_mem0_clk_gate_mem_reg_14_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_12_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_12_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_12_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_12_/CLK]
set_load -max 0.00070124  [get_nets cu1_mem0_clk_gate_mem_reg_12_/EN]
set_load -min 0.000593327  [get_nets cu1_mem0_clk_gate_mem_reg_12_/EN]
set_resistance -max 0.0205614  [get_nets cu1_mem0_clk_gate_mem_reg_12_/EN]
set_resistance -min 0.0733112  [get_nets cu1_mem0_clk_gate_mem_reg_12_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_10_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_10_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_10_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_10_/CLK]
set_load -max 0.000307734  [get_nets cu1_mem0_clk_gate_mem_reg_10_/EN]
set_load -min 0.000271266  [get_nets cu1_mem0_clk_gate_mem_reg_10_/EN]
set_resistance -max 0.0127146  [get_nets cu1_mem0_clk_gate_mem_reg_10_/EN]
set_resistance -min 0.0622302  [get_nets cu1_mem0_clk_gate_mem_reg_10_/EN]
set_load -max 0.0102317  [get_nets cu1_mem0_clk_gate_mem_reg_9_/CLK]
set_load -min 0.00942  [get_nets cu1_mem0_clk_gate_mem_reg_9_/CLK]
set_resistance -max 0.379181  [get_nets cu1_mem0_clk_gate_mem_reg_9_/CLK]
set_resistance -min 1.25473  [get_nets cu1_mem0_clk_gate_mem_reg_9_/CLK]
set_load -max 0.00103833  [get_nets cu1_mem0_clk_gate_mem_reg_9_/EN]
set_load -min 0.000905893  [get_nets cu1_mem0_clk_gate_mem_reg_9_/EN]
set_resistance -max 0.0290393  [get_nets cu1_mem0_clk_gate_mem_reg_9_/EN]
set_resistance -min 0.0849821  [get_nets cu1_mem0_clk_gate_mem_reg_9_/EN]
