###################################################################

# Created by write_sdc on Mon Aug 1 17:16:59 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode top
set_wire_load_model -name ZeroWireload -library tcbn45gsbwpml
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports clk]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports reset]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports io_enable]
set_driving_cell -lib_cell INVD0BWP -library tcbn45gsbwpml -pin ZN [get_ports io_config_enable]
set_load -pin_load 0.19856 [get_ports io_done]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[6]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[5]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[4]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[3]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[2]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[1]}]
set_load -pin_load 0.19856 [get_ports {io_scalarOut[0]}]
set_load -pin_load 0.19856 [get_ports io_rmux0]
set_load -pin_load 0.19856 [get_ports io_rmux1]
set_load -pin_load 0.19856 [get_ports {io_opcode[6]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[5]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[4]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[3]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[2]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[1]}]
set_load -pin_load 0.19856 [get_ports {io_opcode[0]}]
set_load -pin_load 0.19856 [get_ports io_opA_isLocal]
set_load -pin_load 0.19856 [get_ports {io_opA_local[6]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[5]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[4]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[3]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[2]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[1]}]
set_load -pin_load 0.19856 [get_ports {io_opA_local[0]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[6]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[5]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[4]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[3]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[2]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[1]}]
set_load -pin_load 0.19856 [get_ports {io_opA_remote[0]}]
set_load -pin_load 0.19856 [get_ports io_opB_isLocal]
set_load -pin_load 0.19856 [get_ports {io_opB_local[6]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[5]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[4]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[3]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[2]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[1]}]
set_load -pin_load 0.19856 [get_ports {io_opB_local[0]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[6]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[5]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[4]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[3]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[2]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[1]}]
set_load -pin_load 0.19856 [get_ports {io_opB_remote[0]}]
set_load -pin_load 0.19856 [get_ports {io_result[6]}]
set_load -pin_load 0.19856 [get_ports {io_result[5]}]
set_load -pin_load 0.19856 [get_ports {io_result[4]}]
set_load -pin_load 0.19856 [get_ports {io_result[3]}]
set_load -pin_load 0.19856 [get_ports {io_result[2]}]
set_load -pin_load 0.19856 [get_ports {io_result[1]}]
set_load -pin_load 0.19856 [get_ports {io_result[0]}]
set_max_transition 0.1 [get_ports io_done]
set_max_transition 0.1 [get_ports {io_scalarOut[6]}]
set_max_transition 0.1 [get_ports {io_scalarOut[5]}]
set_max_transition 0.1 [get_ports {io_scalarOut[4]}]
set_max_transition 0.1 [get_ports {io_scalarOut[3]}]
set_max_transition 0.1 [get_ports {io_scalarOut[2]}]
set_max_transition 0.1 [get_ports {io_scalarOut[1]}]
set_max_transition 0.1 [get_ports {io_scalarOut[0]}]
set_max_transition 0.1 [get_ports io_rmux0]
set_max_transition 0.1 [get_ports io_rmux1]
set_max_transition 0.1 [get_ports {io_opcode[6]}]
set_max_transition 0.1 [get_ports {io_opcode[5]}]
set_max_transition 0.1 [get_ports {io_opcode[4]}]
set_max_transition 0.1 [get_ports {io_opcode[3]}]
set_max_transition 0.1 [get_ports {io_opcode[2]}]
set_max_transition 0.1 [get_ports {io_opcode[1]}]
set_max_transition 0.1 [get_ports {io_opcode[0]}]
set_max_transition 0.1 [get_ports io_opA_isLocal]
set_max_transition 0.1 [get_ports {io_opA_local[6]}]
set_max_transition 0.1 [get_ports {io_opA_local[5]}]
set_max_transition 0.1 [get_ports {io_opA_local[4]}]
set_max_transition 0.1 [get_ports {io_opA_local[3]}]
set_max_transition 0.1 [get_ports {io_opA_local[2]}]
set_max_transition 0.1 [get_ports {io_opA_local[1]}]
set_max_transition 0.1 [get_ports {io_opA_local[0]}]
set_max_transition 0.1 [get_ports {io_opA_remote[6]}]
set_max_transition 0.1 [get_ports {io_opA_remote[5]}]
set_max_transition 0.1 [get_ports {io_opA_remote[4]}]
set_max_transition 0.1 [get_ports {io_opA_remote[3]}]
set_max_transition 0.1 [get_ports {io_opA_remote[2]}]
set_max_transition 0.1 [get_ports {io_opA_remote[1]}]
set_max_transition 0.1 [get_ports {io_opA_remote[0]}]
set_max_transition 0.1 [get_ports io_opB_isLocal]
set_max_transition 0.1 [get_ports {io_opB_local[6]}]
set_max_transition 0.1 [get_ports {io_opB_local[5]}]
set_max_transition 0.1 [get_ports {io_opB_local[4]}]
set_max_transition 0.1 [get_ports {io_opB_local[3]}]
set_max_transition 0.1 [get_ports {io_opB_local[2]}]
set_max_transition 0.1 [get_ports {io_opB_local[1]}]
set_max_transition 0.1 [get_ports {io_opB_local[0]}]
set_max_transition 0.1 [get_ports {io_opB_remote[6]}]
set_max_transition 0.1 [get_ports {io_opB_remote[5]}]
set_max_transition 0.1 [get_ports {io_opB_remote[4]}]
set_max_transition 0.1 [get_ports {io_opB_remote[3]}]
set_max_transition 0.1 [get_ports {io_opB_remote[2]}]
set_max_transition 0.1 [get_ports {io_opB_remote[1]}]
set_max_transition 0.1 [get_ports {io_opB_remote[0]}]
set_max_transition 0.1 [get_ports {io_result[6]}]
set_max_transition 0.1 [get_ports {io_result[5]}]
set_max_transition 0.1 [get_ports {io_result[4]}]
set_max_transition 0.1 [get_ports {io_result[3]}]
set_max_transition 0.1 [get_ports {io_result[2]}]
set_max_transition 0.1 [get_ports {io_result[1]}]
set_max_transition 0.1 [get_ports {io_result[0]}]
create_clock [get_ports clk]  -name ideal_clock1  -period 1  -waveform {0 0.5}
set_max_delay 0.2  -from [list [get_ports clk] [get_ports reset] [get_ports io_enable] [get_ports io_config_enable]]  -to [list [get_ports io_done] [get_ports {io_scalarOut[6]}] [get_ports {io_scalarOut[5]}] [get_ports {io_scalarOut[4]}] [get_ports {io_scalarOut[3]}] [get_ports {io_scalarOut[2]}] [get_ports {io_scalarOut[1]}] [get_ports {io_scalarOut[0]}] [get_ports io_rmux0] [get_ports io_rmux1] [get_ports {io_opcode[6]}] [get_ports {io_opcode[5]}] [get_ports {io_opcode[4]}] [get_ports {io_opcode[3]}] [get_ports {io_opcode[2]}] [get_ports {io_opcode[1]}] [get_ports {io_opcode[0]}] [get_ports io_opA_isLocal] [get_ports {io_opA_local[6]}] [get_ports {io_opA_local[5]}] [get_ports {io_opA_local[4]}] [get_ports {io_opA_local[3]}] [get_ports {io_opA_local[2]}] [get_ports {io_opA_local[1]}] [get_ports {io_opA_local[0]}] [get_ports {io_opA_remote[6]}] [get_ports {io_opA_remote[5]}] [get_ports {io_opA_remote[4]}] [get_ports {io_opA_remote[3]}] [get_ports {io_opA_remote[2]}] [get_ports {io_opA_remote[1]}] [get_ports {io_opA_remote[0]}] [get_ports io_opB_isLocal] [get_ports {io_opB_local[6]}] [get_ports {io_opB_local[5]}] [get_ports {io_opB_local[4]}] [get_ports {io_opB_local[3]}] [get_ports {io_opB_local[2]}] [get_ports {io_opB_local[1]}] [get_ports {io_opB_local[0]}] [get_ports {io_opB_remote[6]}] [get_ports {io_opB_remote[5]}] [get_ports {io_opB_remote[4]}] [get_ports {io_opB_remote[3]}] [get_ports {io_opB_remote[2]}] [get_ports {io_opB_remote[1]}] [get_ports {io_opB_remote[0]}] [get_ports {io_result[6]}] [get_ports {io_result[5]}] [get_ports {io_result[4]}] [get_ports {io_result[3]}] [get_ports {io_result[2]}] [get_ports {io_result[1]}] [get_ports {io_result[0]}]]
